// 自动生成的领域卡牌文件
const 午夜_CARDS = [
  {
    "ID": "Uncanny_Disguise",
    "名称": "奇异伪装Uncanny Disguise",
    "领域": "午夜",
    "等级": 1,
    "属性": "法术",
    "回想": 0,
    "描述": "如果你有数分钟用以准备，你可以标记1点压力以伪装成任何能够在你脑海中清晰回想起外貌的人型生物。当你伪装时，所有用以对抗识破的风度属性掷骰均具有优势。\n在这张卡上放置数量等同于你施法属性的指示物，当你在伪装状态下执行一个行动，花费一个指示物。在花费掉最后一个指示物的行动结算后，伪装解除。",
    "卡图": "resource/领域/午夜/1奇异伪装.png"
  },
  {
    "ID": "Rain_of_Blades",
    "名称": "滂沱剑雨Rain of Blades",
    "领域": "午夜",
    "等级": 1,
    "属性": "法术",
    "回想": 1,
    "描述": "花费1点希望以召唤数把利剑，攻击所有在你近距离范围内的敌人。进行一次施法掷骰，所有你成功对抗的目标受到等同你熟练数的d8+2魔法伤害。\n如果你击中的任何处于脆弱状态的目标，其额外承受1d8的魔法伤害。",
    "卡图": "resource/领域/午夜/1滂沱剑雨.png"
  },
  {
    "ID": "Pick_and_Pull",
    "名称": "妙手空空Pick and Pull",
    "领域": "午夜",
    "等级": 1,
    "属性": "能力",
    "回想": 0,
    "描述": "你在打开非魔法锁、解除陷阱或从一名目标身上偷取物品（无论是潜行偷盗还是暴力夺取）的动作掷骰上具有优势。",
    "卡图": "resource/领域/午夜/1妙手空空.png"
  },
  {
    "ID": "Shadowbind",
    "名称": "影缚Shadowbind",
    "领域": "午夜",
    "等级": 2,
    "属性": "咒语",
    "回想": 0,
    "描述": "进行一次施法掷骰对抗所有在你临近范围内的敌人。你成功对抗的、所有拥有影子的敌人都会被暂时性的固定在原处，陷入束缚状态。",
    "卡图": "resource/领域/午夜/2影缚.png"
  },
  {
    "ID": "Midnight_Spirit",
    "名称": "午夜精魂Midnight Spirit",
    "领域": "午夜",
    "等级": 2,
    "属性": "咒语",
    "回想": 1,
    "描述": "花费1点希望以召唤一个人形大小的奥术精魂，并且其可以移动或者搬运你所能看见的东西，直到你的下一次短休。\n你也可以派遣你的精魂以一名敌人为目标进行一次攻击。当你这么做时，进行一次施法掷骰对抗一名在极远范围内的敌人。如果成功，骰等同于你施法属性值数的d6骰，造成与掷骰结果等量的魔法伤害，然后你的精魂将会消散。\n你只能同时拥有一个精魂。",
    "卡图": "resource/领域/午夜/2午夜精魂.png"
  },
  {
    "ID": "Chokehold",
    "名称": "锁喉Chokehold",
    "领域": "午夜",
    "等级": 3,
    "属性": "能力",
    "回想": 1,
    "描述": "当你隐匿时，如果你成功置身于某个大小与你相近的生物的背后时，你可以使用一个动作并标记1点压力，锁住他们的喉咙或任何能造成同等效果的位置，使他们暂时陷入脆弱状态。\n所有对因你锁喉而造成脆弱状态的敌人所发起的攻击在伤害掷骰中增加2d6。",
    "卡图": "resource/领域/午夜/3锁喉.png"
  },
  {
    "ID": "Veil_of_Shadows",
    "名称": "暗影面纱Veil of Shadows",
    "领域": "午夜",
    "等级": 3,
    "属性": "咒语",
    "回想": 1,
    "描述": "进行一次施法掷骰（13）。如果成功，你可以在以你为中心的远距离范围内任意两点之间创造一道临时的黑暗帷幕，其高度等于你身高的两倍。只有你可以看穿由此效应造成的黑暗。你对帷幕对面的目标发起的攻击掷骰具有优势，且你对于帷幕对面的敌人而言始终视为隐匿状态。该效应将持续到你施放另一个法术。",
    "卡图": "resource/领域/午夜/3暗影面纱.png"
  },
  {
    "ID": "Stealth_Expertise",
    "名称": "潜行专家Stealth Expertise",
    "领域": "午夜",
    "等级": 4,
    "属性": "能力",
    "回想": 0,
    "描述": "当你试图在不被发现的情况下穿过一个危险区域时，若你骰出恐惧结果，你总是可以标记1点压力改为骰出希望结果。\n如果一名近距离的盟友同样试图在不被发现的情况下移动并骰出了恐惧结果，你也可以标记1点压力将其掷骰结果改为骰出希望结果。",
    "卡图": "resource/领域/午夜/4潜行专家.png"
  },
  {
    "ID": "Midnight_Mark",
    "名称": "午夜印记Midnight Mark",
    "领域": "午夜",
    "等级": 4,
    "属性": "咒语",
    "回想": 1,
    "描述": "进行一次施法掷骰对抗临近范围内的一个目标。如果成功，你花费1点希望以召唤一个揭示目标弱点的黑暗符印，暂时性地降低其难度（Difficulty），降低的数值等同于1+你的知识属性值。",
    "卡图": "resource/领域/午夜/4午夜印记.png"
  },
  {
    "ID": "Hush",
    "名称": "沉默Hush",
    "领域": "午夜",
    "等级": 5,
    "属性": "咒语",
    "回想": 1,
    "描述": "进行一次施法掷骰对抗近距离范围内的一个目标。如果成功，你花费1点希望以暂时性召唤一道压制性法术环绕在目标周围，笼罩以目标为圆心的临近范围内的所有东西，该法术效应会跟随目标移动。\n目标以及法术范围内的所有东西不能发出任何噪音，也不能施放任何法术，直到GM使用1点恐惧点解除状态、你再次施放此法术、或你受到损伤。",
    "卡图": "resource/领域/午夜/5沉默.png"
  },
  {
    "ID": "Phantom_Retreat",
    "名称": "移形换影Phantom Retreat",
    "领域": "午夜",
    "等级": 5,
    "属性": "咒语",
    "回想": 2,
    "描述": "花费1点希望，在你目前站立的地方启动移形换影。在你的下次短休前，你可以随时花费1点希望从你当前位置消失并出现在你启动移形换影的地方，这么做会结束这个法术。",
    "卡图": "resource/领域/午夜/5移形换影.png"
  },
  {
    "ID": "Mass_Disguise",
    "名称": "群体伪装Mass Disguise",
    "领域": "午夜",
    "等级": 6,
    "属性": "咒语",
    "回想": 0,
    "描述": "如果你有数分钟用以准备，你可以标记1点压力，使你近距离范围内的所有自愿生物改变外貌，持续1小时。他们的新外貌必须分享一个共有的身体结构和大小，可以是任何你曾经见过的、或是完全杜撰出来的人与物品。一个伪装的生物对抗识破的风度属性掷骰具有优势。\n开始一个从8开始的能被GM以某种理由降低的d8倒计时。当它到达0时，伪装解除。",
    "卡图": "resource/领域/午夜/6群体伪装.png"
  },
  {
    "ID": "Dark_Whispers",
    "名称": "黑暗低语Dark Whispers",
    "领域": "午夜",
    "等级": 6,
    "属性": "咒语",
    "回想": 0,
    "描述": "你可以在任何你见过面或知道真名的人的脑海中低语。\n当你这么做时，你可以标记1点压力以进行一次施法掷骰对抗你的目标。如果成功，你可以向他们问以下问题中的一个：\n你在哪里？\n你在干什么？\n你在害怕什么？\n在这个世界上你最珍惜的什么？",
    "卡图": "resource/领域/午夜/6黑暗低语.png"
  },
  {
    "ID": "Midnight_Touched",
    "名称": "午夜恩泽Midnight Touched",
    "领域": "午夜",
    "等级": 7,
    "属性": "能力",
    "回想": 2,
    "描述": "当你的配置（Loadout）的领域卡中午夜领域的卡片占多数时：\n每当你骰出恐惧结果的成功时，你获的1点希望。\n如果你的恐惧骰掷出的结果为1或2，你可以重新进行一次掷骰并接受新的结果。",
    "卡图": "resource/领域/午夜/7午夜恩泽.png"
  },
  {
    "ID": "Phantom_Dodge",
    "名称": "幻影闪避Phantom Dodge",
    "领域": "午夜",
    "等级": 7,
    "属性": "咒语",
    "回想": 1,
    "描述": "如果你成功闪避了一次物理伤害，你可以将自己藏身于影子之中，进入隐匿（Hidden）状态并传送到以对你发起攻击的目标为圆心、近距离范围内的任意一点。在你进行下一次动作掷骰前，你将持续保持隐匿状态。",
    "卡图": "resource/领域/午夜/7幻影闪避.png"
  },
  {
    "ID": "Spellcharge",
    "名称": "法术充能Spellcharge",
    "领域": "午夜",
    "等级": 8,
    "属性": "咒语",
    "回想": 1,
    "描述": "在你将要受到一次魔法伤害时，放同等于该次伤害使你失去的生命值数的指示物在此卡上。\n每当你进行一次成功的攻击掷骰，你可以花费此卡上任意数量的指示物，在最终的伤害上增加同等骰子数的d6魔法伤害。在你的下一次休息时，清除此卡上的所有指示物。",
    "卡图": "resource/领域/午夜/8法术充能.png"
  },
  {
    "ID": "Shadowhunter",
    "名称": "暗影猎人Shadowhunter",
    "领域": "午夜",
    "等级": 8,
    "属性": "能力",
    "回想": 2,
    "描述": "在阴影的掩护下，你的实力得到增长。当你处在微光或黑暗笼罩下的环境时，你的熟练与闪避+1。",
    "卡图": "resource/领域/午夜/8暗影猎人.png"
  },
  {
    "ID": "Night_Terror",
    "名称": "夜之恐惧Night Terror",
    "领域": "午夜",
    "等级": 9,
    "属性": "咒语",
    "回想": 2,
    "描述": "每长休一次，使用一个动作，选择邻近范围内、任意数量的目标。对他们而言，你的面容变得像噩梦一般恐怖，他们必须进行一次成功的反应掷骰（16），否则将会暂时性陷入恐惧。当他们恐惧时，他们处于脆弱（Vulnerable）状态。同时，你从GM的恐惧池中窃取恐惧点，数量等同于陷入恐惧状态的目标数（如果没有足够的恐惧，则尽量拿取）。你每窃取1点恐惧点，骰一次d6并对每一个被恐惧的目标造成等量伤害，然后移去这些恐惧点。",
    "卡图": "resource/领域/午夜/9夜之恐惧.png"
  },
  {
    "ID": "Twilight_Toll",
    "名称": "暮光丧钟Twilight Toll",
    "领域": "午夜",
    "等级": 9,
    "属性": "能力",
    "回想": 2,
    "描述": "选择一个远距离范围内的目标并进行标记。每当你对抗目标、且不会造成伤害的的动作掷骰成功时，在此卡上放置一个指示物。当你对目标进行伤害掷骰时，你可以花费任意数量的指示物以造成额外的伤害，伤害等同于花费指示物数量的d12。你每次只能在一个生物身上维持暮光丧钟。",
    "卡图": "resource/领域/午夜/9暮光丧钟.png"
  },
  {
    "ID": "Specter_of_the_Dark",
    "名称": "黑暗幽灵Specter of the Dark",
    "领域": "午夜",
    "等级": 10,
    "属性": "咒语",
    "回想": 1,
    "描述": "标记1点压力值，使你像鬼魂一样移动。在这个形态下，你能够被目视，但是处于漂浮状态且能够穿过坚固的物体，此状态维持到你下一次进行以另一个生物为目标的动作掷骰。在维持形态期间，你对物理伤害免疫。",
    "卡图": "resource/领域/午夜/10黑暗幽灵.png"
  }
];

module.exports = {
    午夜_CARDS
};