// 自动生成的领域卡牌文件
window.优雅_CARDS = [
  {
    "ID": "Enrapture",
    "名称": "心醉神迷",
    "领域": "优雅",
    "等级": 1,
    "属性": "法术",
    "回想": 0,
    "描述": "执行一次施法掷骰，对抗一名在你近距离范围（Close）内的目标。如果成功，你会暂时性地让目标的注意力放在你身上，目标的视野和听觉都会被限制，除了你的声音，其他任何声音都会被其无视。每短休一次，你还可以在成功对目标标记一点压力值后，额外再标记一点压力值。",
    "卡图": "resource/领域/优雅/1心醉神迷.png"
  },
  {
    "ID": "Inspirational_Words",
    "名称": "豪言壮语",
    "领域": "优雅",
    "等级": 1,
    "属性": "能力",
    "回想": 1,
    "描述": "你可以让你的言语充满力量。在每次游戏（Session）开始前，在这张卡上放置等同于你风度属性（Persence）数值的指示物。当你朗诵词句时，你可以花费1个指示物并选择以下一个选项，并将其应用在所有能够听到你说话的盟友上。如果动作追踪器（Action Tracker）在使用中，你需要上面放置一个动作指示物。在每局游戏结束后，清除所有指示物。\n清除1点压力\n恢复1点生命值\n获得1点希望点",
    "卡图": "resource/领域/优雅/1豪言壮语.png"
  },
  {
    "ID": "Deft_Deceiver",
    "名称": "调虎离山",
    "领域": "优雅",
    "等级": 1,
    "属性": "能力",
    "回想": 0,
    "描述": "花费1点希望，在欺骗或愚弄他人相信你的掷骰上获得优势。",
    "卡图": "resource/领域/优雅/1调虎离山.png"
  },
  {
    "ID": "Tell_No_Lies",
    "名称": "无可讳言",
    "领域": "优雅",
    "等级": 2,
    "属性": "法术",
    "回想": 1,
    "描述": "执行一次施法掷骰，对抗一名在你邻近范围（Very Close）内的目标。如果成功，他们在近距离范围（Close）内不能对你说谎，但是他们可以选择拒绝说话。如果你向目标提问但拒绝回答，目标会标记1点压力值然后该法术结束。",
    "卡图": "resource/领域/优雅/2无可讳言.png"
  },
  {
    "ID": "Troublemaker",
    "名称": "惹是生非",
    "领域": "优雅",
    "等级": 2,
    "属性": "能力",
    "回想": 1,
    "描述": "当你嘲讽或者挑拨一名远距离（Far）内的敌人，执行一次风度（Presence）掷骰与其对抗。如果成功，骰等同于你熟练（Proficiency）值数的d4，在其中取最高值，然后对目标标记同等数量的压力。",
    "卡图": "resource/领域/优雅/2惹是生非.png"
  },
  {
    "ID": "Invisibility",
    "名称": "无影无踪",
    "领域": "优雅",
    "等级": 3,
    "属性": "法术",
    "回想": 1,
    "描述": "在触碰一个生物时执行一次施法掷骰（10）。如果成功，标记1点压力，然后目标在一小时内变成隐匿（Hidden）状态，直到你再次施放这个法术，或者其执行一次攻击掷骰或施法掷骰。",
    "卡图": "resource/领域/优雅/3无影无踪.png"
  },
  {
    "ID": "Hypnotic_Shimmer",
    "名称": "催眠闪光",
    "领域": "优雅",
    "等级": 3,
    "属性": "法术",
    "回想": 1,
    "描述": "执行一次施法掷骰，对抗任意名在你面前的近距离范围（Close）内的目标。如果成功，每短休一次，你可以制造一个彩色闪光幻象，使所有你对抗成功的目标暂时陷入晕眩（Stun）状态，且使他们各标记一点压力值，在晕眩状态移除前其不可以移动或是执行动作。",
    "卡图": "resource/领域/优雅/3催眠闪光.png"
  },
  {
    "ID": "Soothing_Speech",
    "名称": "温言慰心",
    "领域": "优雅",
    "等级": 4,
    "属性": "能力",
    "回想": 1,
    "描述": "在短休期间，当你对另一名角色使用处理伤口（Tend to Wounds）的休息行动（Downtime move）时，你可以对其说出鼓励性的话语，从而额外恢复1点生命值。当你这么做的时候，你自己同时恢复2点生命值。",
    "卡图": "resource/领域/优雅/4温言慰心.png"
  },
  {
    "ID": "Through_Your_Eyes",
    "名称": "见你所见",
    "领域": "优雅",
    "等级": 4,
    "属性": "法术",
    "回想": 1,
    "描述": "选择一个在极远范围（Very Far）内的目标，你可以获得其视觉和听觉。你可以随时中止这个效应，或者在你施放另一个法术或失去生命值时中止。",
    "卡图": "resource/领域/优雅/4见你所见.png"
  },
  {
    "ID": "Words_of_Discord",
    "名称": "挑拨离间",
    "领域": "优雅",
    "等级": 5,
    "属性": "法术",
    "回想": 1,
    "描述": "当你对着一个近战范围内的敌人耳语让他们反目成仇时，执行一次施法掷骰（13）。如果成功，目标将会立刻标记1点压力，然后对另一名敌人执行攻击，而不是对你和你的盟友。如果在战斗中使用，GM依然需要花费一个动作标记来执行此动作。\n当此次攻击结束，目标会意识到刚刚发生了什么。你对其使用的下一次挑拨离间，施法掷骰难度将会+5。",
    "卡图": "resource/领域/优雅/5挑拨离间.png"
  },
  {
    "ID": "Thought_Delver",
    "名称": "思想挖掘",
    "领域": "优雅",
    "等级": 5,
    "属性": "法术",
    "回想": 2,
    "描述": "你可以窥探他人的思想。花费1点希望，读取一名远距离（Far）范围内的目标的浅层意识。如果你想要读取更多深层想法，你需要执行一次施法掷骰对抗。",
    "卡图": "resource/领域/优雅/5思想挖掘.png"
  },
  {
    "ID": "Share_the_Burden",
    "名称": "排忧解难",
    "领域": "优雅",
    "等级": 6,
    "属性": "法术",
    "回想": 0,
    "描述": "每短休一次，你可以执行一次动作（Action）来吸收一名你可以触碰的自愿生物的压力。目标通过心灵感应向你吐露秘密或是倾泻情感，然后其向你转移任意数量的压力点，同时你获得等量的希望点。",
    "卡图": "resource/领域/优雅/6排忧解难.png"
  },
  {
    "ID": "Never_Upstaged",
    "名称": "始终夺目",
    "领域": "优雅",
    "等级": 6,
    "属性": "能力",
    "回想": 1,
    "描述": "当你在一次攻击失去1点或更多的生命值时，你可以标记一点压力，放置等同于失去生命值数量的指示物于此卡上。此卡上每有一个指示物，你的下一次成功的攻击伤害+5，然后清除所有指示物。\n如果在你执行长休的时候，此卡上仍有指示物，清除等量的压力点。",
    "卡图": "resource/领域/优雅/6始终夺目.png"
  },
  {
    "ID": "Grace_Touched",
    "名称": "优雅恩泽",
    "领域": "优雅",
    "等级": 7,
    "属性": "能力",
    "回想": 2,
    "描述": "当你的配置（Loadout）的领域卡中优雅领域的卡片占多数时：\n你可以在标记1点压力时改为标记1点护甲槽（Armor Slot）。\n当你在动作掷骰（Action Roll）中获得一次关键成功（Critical Success）时，你可以使一名近距离（Close）范围内的敌人标记1点压力，或一名近距离范围内的盟友获得1点希望。\n当你对一名目标造成伤害时，你可以改为标记等量的压力。",
    "卡图": "resource/领域/优雅/7优雅恩泽.png"
  },
  {
    "ID": "Endless_Charisma",
    "名称": "无穷魅力",
    "领域": "优雅",
    "等级": 7,
    "属性": "能力",
    "回想": 1,
    "描述": "当你执行一次动作掷骰以说服、撒谎或是获得青睐时，你可以花费1点希望重投希望骰或恐惧骰，并接受新结果。",
    "卡图": "resource/领域/优雅/7无穷魅力.png"
  },
  {
    "ID": "Astral_Projection",
    "名称": "星界投影",
    "领域": "优雅",
    "等级": 8,
    "属性": "法术",
    "回想": 0,
    "描述": "每长休一次，你可以标记一点压力以创造一个你的复制投影，并使其出现在任何你曾经去过的地方。\n你与投影共享视觉和听觉，也能够如同你本人在该处一样影响这个地方。任何调查过这个投影的人可以说出投影魔法的源头。这个投影将会在你下一个短休或受到伤害时消散。",
    "卡图": "resource/领域/优雅/8星界投影.png"
  },
  {
    "ID": "Mass_Enrapture",
    "名称": "群体心醉神迷",
    "领域": "优雅",
    "等级": 8,
    "属性": "法术",
    "回想": 3,
    "描述": "执行一次施法掷骰，对抗所有在你远距离范围（Far）内的敌人。如果成功，你会暂时性地让他们的注意力放在你身上，他们的视野和听觉都会被限制，除了你的声音，其他任何声音都会被其无视。每短休一次，你还可以在成功对任意目标标记一点压力值后，额外再标记一点压力值。",
    "卡图": "resource/领域/优雅/8群体心醉神迷.png"
  },
  {
    "ID": "Master_of_the_Craft",
    "名称": "技艺大师",
    "领域": "优雅",
    "等级": 9,
    "属性": "能力",
    "回想": 0,
    "描述": "你的两项经历+2，或者一项经历+3。然后将此卡永久置于你的宝库。",
    "卡图": "resource/领域/优雅/9技艺大师.png"
  },
  {
    "ID": "Copycat",
    "名称": "惟妙惟肖",
    "领域": "优雅",
    "等级": 9,
    "属性": "法术",
    "回想": 3,
    "描述": "每长休一次，这张卡可以伪装成任意在其他玩家的配置中的其他8级或以下的领域卡。你必须花费等同于该卡等级一半（向上取整）的希望，该效应持续到你的下一次短休或者他们将被伪装的卡放入他们的宝库。",
    "卡图": "resource/领域/优雅/9惟妙惟肖.png"
  },
  {
    "ID": "Notorius",
    "名称": "恶名昭著",
    "领域": "优雅",
    "等级": 10,
    "属性": "能力",
    "回想": 1,
    "描述": "人们知道你是谁，也知道你做了什么，这会影响他们对你的态度。当你利用恶名去获得你想要的东西时，标记1点压力，然后在掷骰结果中+10。所有的食物、饮品在任何地方对你而言都是免费的，且所有你购买的物品售价都会降低一盒金币（最低到一把金币）。\n这张卡必须时刻处于你的配置，但不会计入你的领域卡上限。",
    "卡图": "resource/领域/优雅/10恶名昭著.png"
  }
];

module.exports = {
    优雅_CARDS
};