// 自动生成的领域卡牌文件
window.典籍_CARDS = [
  {
    "ID": "Book_of_Illiat",
    "名称": "伊利亚特之书",
    "领域": "典籍",
    "等级": 1,
    "属性": "术典",
    "回想": 2,
    "描述": "睡眠术Slumber 执行一次施法掷骰，对抗一个邻近（Very Close）目标。如果成功，目标进入沉睡状态，直到受到伤害，或者DM使用一点恐惧点将其唤醒。\n奥术弹幕Arcane Barrage 每短休一次，使用一个动作（Action），花费任意点希望施放，射出能够自动命中目标的魔法投射物，攻击一个位于近距离（Close）范围的敌人。投掷等同于你使用此动作花费的希望数量的d6，造成等量的直接魔法伤害。\n心灵感应Telepathy 你可以与一个你能够看到的目标建立精神链接执行沟通，该链接会在你使用该法术选择另一个目标的时候自动中断。",
    "卡图": "resource/领域/典籍/1伊利亚特之书.png"
  },
  {
    "ID": "Book_of_Tyfar",
    "名称": "提法之书",
    "领域": "典籍",
    "等级": 1,
    "属性": "术典",
    "回想": 2,
    "描述": "狂野明焰 Wild Flame 执行一次施法掷骰，对抗至多三个在你近战范围内的敌人。一团火焰在你的手中爆发，对所有对抗成功的目标造成2d6魔法伤害以及1点压力点。\n魔法之手 Magic Hand 你可以生成一只大小和力量等同与你自身的魔法之手，在远距离（Far）范围内视同由你自己操作一般。\n神秘迷雾 Mysterious Mist 使用一个动作（Action）并花费1点希望，以你自身为中心、范围至多为邻近（Very Close）施放一团临时的、不可移动的厚重迷雾。所有处于迷雾中的人对外视为躲藏（Hidden）状态。",
    "卡图": "resource/领域/典籍/1提法之书.png"
  },
  {
    "ID": "Book_of_Ava",
    "名称": "艾娃之书",
    "领域": "典籍",
    "等级": 1,
    "属性": "术典",
    "回想": 2,
    "描述": "巨力推撞Power Push 执行一次施法掷骰，对抗一名在你近战范围内的目标。如果成功，目标将会被推至远距离（Far），然后受到等同于你熟练数的d10+2魔法伤害。\n塔瓦的护甲 Tava's Armor 使用一个动作（Action）并花费1点希望，对一名你可以触碰到的目标，在其下一次标记护甲槽（Armor Slot）时增加1d6的护甲值（Armor Score）。你不能在同一个生物上堆叠此效应。\n冰霜之刺 Ice Spikes 执行一次施法掷骰，在极远距离（Very Far）内召唤巨大的冰刺。 你可以将它们当作武器，若成功对抗你攻击的目标，造成等同于你熟练的d6物理伤害。",
    "卡图": "resource/领域/典籍/1艾娃之书.png"
  },
  {
    "ID": "Book_of_Vagras",
    "名称": "瓦格拉斯之书",
    "领域": "典籍",
    "等级": 2,
    "属性": "术典",
    "回想": 2,
    "描述": "符文锁Runic Lock 你可以在一个你正在触摸的物件上注入符文（锁、箱子、盒子、背包等）。如果有人未经你的允许试图打开，该物件会自动锁住。法术可以被其他人用魔法解除，或者经过一个小时的研究来打开。\n奥术门Aracne Door 如果你的近战范围内没有其他敌人，执行一次施法掷骰（13）。如果成功，花费1点希望从你所在的地方消失，然后在你可目视的远距离（Far）范围内重新出现。\n揭示Reveal 执行一次施法掷骰，如果对抗任意在近距离（Close）内隐藏的东西成功，它们便不再隐藏。",
    "卡图": "resource/领域/典籍/2瓦格拉斯之书.png"
  },
  {
    "ID": "Book_of_Sitil",
    "名称": "斯泰尔之书",
    "领域": "典籍",
    "等级": 2,
    "属性": "术典",
    "回想": 2,
    "描述": "改变容貌Adjust Apperance 你可以魔法般地改变你的外貌和衣着来避免被认出来。\n并行Parallela 花费1点希望，对你自身或是任意一个在你身边的盟友施放此法术。在下一次执行攻击时，其可以将伤害分配至在攻击范围内、攻击掷骰成功的任意目标。\n幻象Illusion 执行一次施法掷骰（14）。如果成功，则制造一个不大于你的体型、在近距离（Close）内的临时视觉幻像。只要其一直在你的视野范围内，它就不会消散。它将持续到直到有人在其范围内仔细地探查。",
    "卡图": "resource/领域/典籍/2斯泰尔之书.png"
  },
  {
    "ID": "Book_of_Norai",
    "名称": "诺莱伊之书",
    "领域": "典籍",
    "等级": 3,
    "属性": "术典",
    "回想": 2,
    "描述": "神秘绳索Mystic Tether执行一次施法掷骰，对抗一名在远距离（Far）范围内的目标。如果成功，其将会暂时受到束缚（Restrained）并标记1点压力。如果你选择了一个正在飞行的目标，该法术将会在束缚目标前将其带到地面。\n火球术Fireball执行一次施法掷骰，对抗一名在极远距离（Very Far）范围内的目标。如果成功，你向其投掷一团火焰法球，击中目标后爆炸。该目标以及其周边邻近（Very Close）需要执行一次反应掷骰（Reaction Roll）（12），如果失败，他们受到等同于你熟练的骰数的d8+5魔法伤害；如果成功，他们受到一半的伤害（向上取整）。",
    "卡图": "resource/领域/典籍/3诺莱伊之书.png"
  },
  {
    "ID": "Book_of_Korvax",
    "名称": "库瓦斯之书",
    "领域": "典籍",
    "等级": 3,
    "属性": "术典",
    "回想": 2,
    "描述": "浮空术Levitation执行一次施法掷骰，暂时使一个你可以看见的目标在其近距离（Close）范围内悬浮并移动。\n一忘皆空Recant 花费1点希望并选择一个目标令其执行一次反应掷骰（15），若其失败，目标将会忘记1分钟前所有与你的对话。\n符文圆环Rune Circle使用一个动作（Action）并标记一点压力值，以你为中心在地上创造一个暂时的魔法圆环。任何处在或进入圆环的近战范围内的生物，会受到2d12+4魔法伤害并在其动作完成后推离圆环范围。",
    "卡图": "resource/领域/典籍/3库瓦斯之书.png"
  },
  {
    "ID": "Book_of_Grynn",
    "名称": "格林之书",
    "领域": "典籍",
    "等级": 4,
    "属性": "术典",
    "回想": 2,
    "描述": "奥术偏转Arcane Deflection 每长休一次，花费1点希望，完全抵消一次对你或你邻近范围（Very Close）内的盟友的攻击所带来的任何伤害。\n时滞之锁Time Lock 选择远距离（Far）内的一个非生物目标。该目标将会在时间与空间的维度上完全停止，直到场景（Scene）结束。如果一个生物尝试移动它，执行一次施法掷骰对抗以维持此法术。\n烈焰之墙Wall Flame 使用一个动作（Action）并标记一点压力值，在远距离（Far）范围内的两点之间创造一面临时的、用魔法火焰构筑的墙壁。所有通过墙壁的东西受到4d10+3魔法伤害。",
    "卡图": "resource/领域/典籍/4格林之书.png"
  },
  {
    "ID": "Book_of_Exota",
    "名称": "伊索塔之书",
    "领域": "典籍",
    "等级": 4,
    "属性": "术典",
    "回想": 3,
    "描述": "法术反制Counterspell 你可以中断一个法术或者正在发生的魔法效应，执行使用你的施法属性（Spellcast Trait）一次反应掷骰。如果成功，该法术或魔法效应会立即停止，同时消除所有由此引发的后续效果，然后将这张卡放入你的宝库（Vault）。\n创造构装体 Creat Construct 花费1点希望，选择你身边的一组物品以创造一个活化的、能够听从简单命令的构装体。执行一次施法掷骰以命令其执行动作。如果需要，其与你共享闪避值和属性值，其攻击造成2d10+3的物理伤害。你每次只可以控制一个构装体，当其受到任意数量的伤害时将会解体。",
    "卡图": "resource/领域/典籍/4伊索塔之书.png"
  },
  {
    "ID": "Teleport",
    "名称": "传送",
    "领域": "典籍",
    "等级": 5,
    "属性": "法术",
    "回想": 2,
    "描述": "每长休一次，你能够瞬间传送自己和近距离（Close）范围内若干数量的自愿目标到一个你知道的地方。选择以下一个选项以获得额外调整值，然后执行一次施法掷骰（16）：\n如果你非常熟悉这个地方，则+5\n如果你经常来到这个地方，则+3\n如果你偶尔来到这个地方，则+1\n如果你只来过这个地方一次，则+0\n如果你从来没来过这地方，则-5\n如果成功，你们将会成功出现在你们想要去的地方。如果失败，你们将会偏离目的地，偏离程度取决于施法掷骰数值与成功值之间的差值。",
    "卡图": "resource/领域/典籍/5传送.png"
  },
  {
    "ID": "Manifest_Wall",
    "名称": "具现之墙",
    "领域": "典籍",
    "等级": 5,
    "属性": "法术",
    "回想": 2,
    "描述": "施法掷骰（15）。如果成功，每短休一次，你可以花费1点希望，以你为中心，在远距离（Far）范围内以任意角度、最高50尺创造一面临时的魔法墙壁。任何生物或物件在其生成路径中都会被击退到其中一侧。墙壁将会在你再次施放此法术或你的下一次长休前消散。",
    "卡图": "resource/领域/典籍/5具现之墙.png"
  },
  {
    "ID": "Banish",
    "名称": "放逐术",
    "领域": "典籍",
    "等级": 6,
    "属性": "法术",
    "回想": 0,
    "描述": "选择一个近距离（Close）范围内的目标生物，你可以暂时把他们放逐出这个位面。使用一个动作（Action），骰等同于你的施法属性（Spellcast Trait）数量的d20，然后将其中最高的结果告诉GM，GM必须执行一次反应掷骰对抗该骰值。\n如果成功，目标标记1点压力；如果失败，每短休一次，目标将会被放逐。当玩家角色骰出恐惧结果（Roll with Fear），GM将会将骰值-1，然后执行一次反应掷骰，如果成功，该生物将会从放逐中回归。",
    "卡图": "resource/领域/典籍/6放逐术.png"
  },
  {
    "ID": "Banish_of_Retribution",
    "名称": "惩戒符印",
    "领域": "典籍",
    "等级": 6,
    "属性": "法术",
    "回想": 2,
    "描述": "使用一个动作（Action），给与GM一个恐惧点并使用惩戒符印标记一个近距离（Close）范围内的敌人。每当该敌人对你或你的盟友造成伤害，于此卡上放置一个d8，上限至多为你的等级数。每当你攻击此敌人，你可以选择骰这些骰子并将骰值加入到你的最终伤害中。该法术将在你于其他目标施放该法术时停止。",
    "卡图": "resource/领域/典籍/6惩戒符印.png"
  },
  {
    "ID": "Codex_Touched",
    "名称": "典籍恩泽",
    "领域": "典籍",
    "等级": 7,
    "属性": "能力",
    "回想": 2,
    "描述": "当你的配置（Loadout）的领域卡中典籍领域的卡片占多数时：\n你可以标记1点压力，将你的熟练（Proficiency）加入到施法掷骰中。\n每短休一次，你可以将此卡与你宝库（Vault）中的任意卡交换，不需要支付回想费用。",
    "卡图": "resource/领域/典籍/7典籍恩泽.png"
  },
  {
    "ID": "Book_of_Homet",
    "名称": "荷美特之书",
    "领域": "典籍",
    "等级": 7,
    "属性": "术典",
    "回想": 0,
    "描述": "畅行无阻Pass Through 以近距离范围内的一面墙或一扇门为目标执行一次施法投掷（13），如果成功，你和任意你触碰的生物可以随意穿行通过。法术将会在所有人都在墙或门的另一侧时结束。\n异界之门Plane Gate执行一次施法投掷（14），如果成功，你打开一条通往另一个你知道、且存在的位面或世界的通道。这条通道将会持续1分钟，或按照你的意愿关闭。",
    "卡图": "resource/领域/典籍/7荷美特之书.png"
  },
  {
    "ID": "Book_of_Vyola",
    "名称": "维奥拉之书",
    "领域": "典籍",
    "等级": 8,
    "属性": "术典",
    "回想": 2,
    "描述": "记忆掘密Memory Delve 执行一次施法掷骰，对抗一个远距离范围内的目标。如果成功，你能够深入目标生物的思想并询问一个问题，GM会描述任何与这个问题答案相关的记忆。\n共享宁静Shared Clarity每长休一次，花费1点希望选择两名自愿生物。每当其中一个目标将要标记压力，他们可以选择由谁来标记压力。这个法术会在他们的下次休息自动结束。",
    "卡图": "resource/领域/典籍/8维奥拉之书.png"
  },
  {
    "ID": "Haven",
    "名称": "避风港",
    "领域": "典籍",
    "等级": 8,
    "属性": "法术",
    "回想": 3,
    "描述": "如果你只有几分钟的平静用以集中精神，你可以花费2点希望来召唤你的避风港——一座巨大的跨位面房屋，你和你的盟友都可以进入其中。当你使用这个法术时，一个魔法门将会在你们选择的近距离范围内的一点出现，且只有你选择的人才能够进入。当你进入时，你可以选择让大门隐形。你和任何在屋内的人都可以随意离开。当你离开时，入口必须再次召唤。\n当你在你自己的避风港内休息时，你可以执行一个额外的休息动作（Downtime Aciton）。",
    "卡图": "resource/领域/典籍/8避风港.png"
  },
  {
    "ID": "Book_of_Ronin",
    "名称": "罗宁之书",
    "领域": "典籍",
    "等级": 9,
    "属性": "术典",
    "回想": 4,
    "描述": "变形Transform 执行一次施法掷骰（15），如果成功，立刻变形成一个你可以在脑海中想象的、不得超过你本体两倍大小的无生命物体。你可以保持这个形态，直到你受到使你失去生命值的伤害。在这个形态下你可以移动，但是可能会引起别人注意。\n稳定传送阵 Stable Portal 每长休一次，使用一个动作，标记1点压力并选择你极远距离范围内的两个地方，一个临时的传送阵将会在两处同时打开，任何生物都可以使用传送阵在两地之间移动。法术将在你的下个短休结束。",
    "卡图": "resource/领域/典籍/9罗宁之书.png"
  },
  {
    "ID": "Disintegration_Wave",
    "名称": "解离浪潮",
    "领域": "典籍",
    "等级": 9,
    "属性": "法术",
    "回想": 4,
    "描述": "执行一次施法投掷（14）。如果成功，每长休一次，GM会告诉你在远距离范围内的任何难度等于或低于14的敌人，你可以为其中每一个想要击中的生物标记1点压力，他们将会立刻被杀死，而且不能被任何途径复活。",
    "卡图": "resource/领域/典籍/9解离浪潮.png"
  },
  {
    "ID": "Book_of_Yarrow",
    "名称": "亚罗之书",
    "领域": "典籍",
    "等级": 10,
    "属性": "术典",
    "回想": 2,
    "描述": "扰乱时间Timejammer 执行一次施法掷骰（18），如果成功，在以你为中心的远距离范围内的，除了你以外的所有人时间会暂时性的慢下来直到停止。该效应将会在你执行一次以其他生物为目标的动作掷骰后停止。\n魔法免疫Magic Immunity 花费5点希望，直到你的下个短休，你对魔法伤害免疫。",
    "卡图": "resource/领域/典籍/10亚罗之书.png"
  }
];

window.典籍_CARDS = 典籍_CARDS;