// 自动生成的领域卡牌文件
const 利刃_CARDS = [
  {
    "ID": "Not_Good_Enough",
    "名称": "未至完美",
    "领域": "利刃",
    "等级": 1,
    "属性": "能力",
    "回想": 1,
    "描述": "每当你进行伤害掷骰时，你可以重骰其中的1和2，你必须接受新的结果，即便其为1或2。",
    "卡图": "resource/领域/利刃/1未至完美.png"
  },
  {
    "ID": "Retaliation",
    "名称": "报复",
    "领域": "利刃",
    "等级": 1,
    "属性": "能力",
    "回想": 1,
    "描述": "每当你受到来自近战范围内的敌人的伤害时，你可以标记1点压力并以立即以一半熟练值的武器伤害骰对其造成伤害（向上取整）。",
    "卡图": "resource/领域/利刃/1报复.png"
  },
  {
    "ID": "Whirlwind",
    "名称": "旋风斩",
    "领域": "利刃",
    "等级": 1,
    "属性": "能力",
    "回想": 0,
    "描述": "使用一把武器进行一次攻击掷骰对抗一个在你近战和邻近范围的目标。如果成功你可以花费1点希望，并以该次掷骰结果对抗所有在那把武器攻击范围内的其他敌人。每一个你成功对抗的额外敌人因此能力受到一半的伤害（向上取整）。",
    "卡图": "resource/领域/利刃/1旋风斩.png"
  },
  {
    "ID": "Reckless",
    "名称": "鲁莽",
    "领域": "利刃",
    "等级": 2,
    "属性": "能力",
    "回想": 1,
    "描述": "你可以标记1点压力使你的一次攻击掷骰具有优势。",
    "卡图": "resource/领域/利刃/2鲁莽.png"
  },
  {
    "ID": "s_Bond",
    "名称": "老兵羁绊",
    "领域": "利刃",
    "等级": 2,
    "属性": "能力",
    "回想": 1,
    "描述": "每长休一次，当你赞扬某人或询问他们所擅长之事，你与其各获得3点希望。",
    "卡图": "resource/领域/利刃/2老兵羁绊's Bond.png"
  },
  {
    "ID": "Versatile_Fighter",
    "名称": "多面武者",
    "领域": "利刃",
    "等级": 3,
    "属性": "能力",
    "回想": 1,
    "描述": "你可以为你装备的武器选择你想要使用的属性值，而不是武器要求的属性值。\n每当你造成伤害时，你可以标记1点压力，使你其中一颗伤害掷骰取最大值，而不是取其骰出的数值。",
    "卡图": "resource/领域/利刃/3多面武者.png"
  },
  {
    "ID": "Scramble",
    "名称": "快步",
    "领域": "利刃",
    "等级": 3,
    "属性": "能力",
    "回想": 1,
    "描述": "每短休一次，当一名近战范围内的敌人将要对你造成伤害时，你可以完全避免此次伤害并安全地移动到此敌人的近战范围之外。",
    "卡图": "resource/领域/利刃/3快步.png"
  },
  {
    "ID": "Deadly_Focus",
    "名称": "致命专注",
    "领域": "利刃",
    "等级": 4,
    "属性": "能力",
    "回想": 2,
    "描述": "每短休一次，你可以将你的注意力集中在单一目标上。选择一个目标，直到你攻击另一个目标、目标被你击败或战斗结束时，你的熟练+1。",
    "卡图": "resource/领域/利刃/4致命专注.png"
  },
  {
    "ID": "Fortified_Armor",
    "名称": "强化护甲",
    "领域": "利刃",
    "等级": 4,
    "属性": "能力",
    "回想": 0,
    "描述": "当你穿着护甲且你的配置中有此卡时，你的护甲值+2。\n每短休一次，你可以在不消耗的情况下使用一次护甲槽。",
    "卡图": "resource/领域/利刃/4强化护甲.png"
  },
  {
    "ID": "s_Edge",
    "名称": "斗士锐锋’",
    "领域": "利刃",
    "等级": 5,
    "属性": "能力",
    "回想": 1,
    "描述": "当你的攻击掷骰骰出关键成功时，你可以花费最多3点希望并选择以下选项中等量的选项：\n恢复1点生命值\n恢复1点护甲槽\n此次伤害使被攻击目标失去的生命值+1",
    "卡图": "resource/领域/利刃/5斗士锐锋’.png"
  },
  {
    "ID": "Vitality",
    "名称": "生命力",
    "领域": "利刃",
    "等级": 5,
    "属性": "能力",
    "回想": 0,
    "描述": "当你获得此卡时，选择以下选项中的两项：\n你的压力槽永久+1\n你的生命值槽永久+1\n你的所有伤害阈值永久+2\n然后将此卡永久置于你的宝库。",
    "卡图": "resource/领域/利刃/5生命力.png"
  },
  {
    "ID": "Rage_Up",
    "名称": "狂怒",
    "领域": "利刃",
    "等级": 6,
    "属性": "能力",
    "回想": 0,
    "描述": "在进行攻击掷骰前，你可以标记1点压力以暂时性地使你此次攻击的伤害掷骰提升你力量属性的两倍的值。\n每次攻击掷骰你可以使用此能力2次。",
    "卡图": "resource/领域/利刃/6狂怒.png"
  },
  {
    "ID": "Battle_Hardened",
    "名称": "战斗坚毅",
    "领域": "利刃",
    "等级": 6,
    "属性": "能力",
    "回想": 2,
    "描述": "每长休一次，当你失去最后一点生命值时，你可以选择承受1点伤痕（永久失去1点希望槽）而不是执行死亡行动（Death Move），然后骰1d6，恢复等同于其骰值的生命并站稳脚跟。",
    "卡图": "resource/领域/利刃/6战斗坚毅.png"
  },
  {
    "ID": "Blade_Touched",
    "名称": "利刃恩泽",
    "领域": "利刃",
    "等级": 7,
    "属性": "能力",
    "回想": 2,
    "描述": "当你的配置（Loadout）的领域卡中利刃领域的卡片占多数时：\n攻击掷骰的结果+2。\n你的重伤阈值+4。",
    "卡图": "resource/领域/利刃/7利刃恩泽.png"
  },
  {
    "ID": "Glancing_Blow",
    "名称": "掠边打击",
    "领域": "利刃",
    "等级": 7,
    "属性": "能力",
    "回想": 1,
    "描述": "当你的一次攻击未命中目标时，你可以标记1点压力，以一半的熟练值对目标造成伤害（向上取整）。",
    "卡图": "resource/领域/利刃/7掠边打击.png"
  },
  {
    "ID": "Battle_Cry",
    "名称": "战吼",
    "领域": "利刃",
    "等级": 8,
    "属性": "能力",
    "回想": 2,
    "描述": "每短休一次，当你朝危险发起冲锋时，你可以发出振奋人心的呼喊或鼓舞你的盟友。你和所有能听到你声音的盟友消除1点压力，获得1点希望，并且+1熟练，直到你或一名盟友骰出恐惧结果失败。",
    "卡图": "resource/领域/利刃/8战吼.png"
  },
  {
    "ID": "Frenzy",
    "名称": "疯狂",
    "领域": "利刃",
    "等级": 8,
    "属性": "能力",
    "回想": 3,
    "描述": "每长休一次，你可以进入疯狂状态直到你的视野中不再有任何威胁。\n当你处于疯狂状态时，你不能使用护甲槽，在你的所有伤害掷骰上+10，且你的重伤阈值+8。",
    "卡图": "resource/领域/利刃/8疯狂.png"
  },
  {
    "ID": "Gore_and_Glory",
    "名称": "血与荣耀",
    "领域": "利刃",
    "等级": 9,
    "属性": "能力",
    "回想": 2,
    "描述": "每当你使用武器造成足够击败一名敌人的伤害时，你可以获得1点希望或消除1点压力。当你在武器攻击掷骰中骰出关键成功时，你可以额外获得1点希望或者额外清除1点压力。",
    "卡图": "resource/领域/利刃/9血与荣耀.png"
  },
  {
    "ID": "s_Strike",
    "名称": "收割打击’",
    "领域": "利刃",
    "等级": 9,
    "属性": "能力",
    "回想": 3,
    "描述": "花费1点希望并进行一次攻击掷骰，GM会告诉你在你武器的攻击范围内你的攻击掷骰成功对抗了哪些敌人。每长休一次，选择其中一名敌人，立即使其失去5点生命值。",
    "卡图": "resource/领域/利刃/9收割打击’.png"
  },
  {
    "ID": "Battle_Monster",
    "名称": "战斗怪物",
    "领域": "利刃",
    "等级": 10,
    "属性": "能力",
    "回想": 0,
    "描述": "当你成功对一名敌人进行攻击时，你可以标记6点压力使其直接失去生命值，数量等同于你当前已失去生命值，而不是进行伤害掷骰。",
    "卡图": "resource/领域/利刃/10战斗怪物.png"
  }
];

module.exports = {
    利刃_CARDS
};