// 自动生成的领域卡牌文件
const 勇气_CARDS = [
  {
    "ID": "Forceful_Push",
    "名称": "强力推撞",
    "领域": "勇气",
    "等级": 1,
    "属性": "能力",
    "回想": 0,
    "描述": "当你成功地进行一次近战攻击时，你可以将目标推撞出你的近战范围（melee），同时花费1点希望使他们暂时变得脆弱。\n如果这次掷骰是骰出希望结果的成功，为此次攻击额外增加1d6的伤害骰。",
    "卡图": "resource/领域/勇气/1强力推撞.png"
  },
  {
    "ID": "I_am_Your_Shield",
    "名称": "吾身为盾",
    "领域": "勇气",
    "等级": 1,
    "属性": "能力",
    "回想": 0,
    "描述": "当在你邻近范围（very close）内的一名盟友将要受到伤害时，你可以标记1点压力以代替其承受伤害。将该次伤害减少等同于你力量属性值的数量。你也可以使用你的护甲槽以降低伤害。",
    "卡图": "resource/领域/勇气/1吾身为盾.png"
  },
  {
    "ID": "Bare_Bones",
    "名称": "铁骨",
    "领域": "勇气",
    "等级": 1,
    "属性": "能力",
    "回想": 0,
    "描述": "当这张卡在你的配置中时，如果你选择不装备护甲，你获得等同于4+等级数值的护甲值。",
    "卡图": "resource/领域/勇气/1铁骨.png"
  },
  {
    "ID": "Body_Basher",
    "名称": "躯体猛击",
    "领域": "勇气",
    "等级": 2,
    "属性": "能力",
    "回想": 1,
    "描述": "你在战斗中充分运用你躯体的力量。当你成功使用近战武器进行一次攻击时，始终将你的力量属性值添加到你的总伤害上。",
    "卡图": "resource/领域/勇气/2躯体猛击.png"
  },
  {
    "ID": "Bold_Presence",
    "名称": "刚健风采",
    "领域": "勇气",
    "等级": 2,
    "属性": "能力",
    "回想": 0,
    "描述": "当你进行一次风采属性掷骰以对抗一名敌对目标时，你可以将你的力量属性值添加到此次掷骰中。",
    "卡图": "resource/领域/勇气/2刚健风采.png"
  },
  {
    "ID": "Lean_On_Me",
    "名称": "中流砥柱",
    "领域": "勇气",
    "等级": 3,
    "属性": "能力",
    "回想": 1,
    "描述": "每长休一次，当一名角色在一次其主动进行的动作中失败时，你可以对其进行安慰或者激励，使你与其皆清除2点压力",
    "卡图": "resource/领域/勇气/3中流砥柱.png"
  },
  {
    "ID": "Critical_Inspiration",
    "名称": "关键鼓舞",
    "领域": "勇气",
    "等级": 3,
    "属性": "能力",
    "回想": 1,
    "描述": "当你或一名盟友在一次攻击掷骰中骰出关键成功时，立刻恢复1点生命值或者清除1点压力值。",
    "卡图": "resource/领域/勇气/3关键鼓舞.png"
  },
  {
    "ID": "Goad_Them_On",
    "名称": "煽惑",
    "领域": "勇气",
    "等级": 4,
    "属性": "能力",
    "回想": 1,
    "描述": "进行一次风采属性掷骰对抗一个目标。如果成功，目标标记1点压力，下次行动时以你为目标且获得劣势。\n（注：不知道是只能指定你为目标且带有劣势，还是可以指定其他人为目标正常但指定你是劣势，应该是前者，等勘误。）",
    "卡图": "resource/领域/勇气/4煽惑.png"
  },
  {
    "ID": "Support_Tank",
    "名称": "支援坦克",
    "领域": "勇气",
    "等级": 4,
    "属性": "能力",
    "回想": 2,
    "描述": "当近距离范围内的一个盟友在一次掷骰中失败，你可以花费2点希望让他们重投希望骰或恐惧骰，然后接受新的结果。",
    "卡图": "resource/领域/勇气/4支援坦克.png"
  },
  {
    "ID": "Armorer",
    "名称": "披甲者",
    "领域": "勇气",
    "等级": 5,
    "属性": "能力",
    "回想": 1,
    "描述": "当你穿着护甲且这张卡在你的配置中时，你的护甲值+1。\n在短休期间，如果你选择了修理护甲（Repair Armor）的休息动作（Downtime Action），你队伍中的每一个人同样恢复一点护甲槽。",
    "卡图": "resource/领域/勇气/5披甲者.png"
  },
  {
    "ID": "Rousing_Strike",
    "名称": "振奋打击",
    "领域": "勇气",
    "等级": 5,
    "属性": "能力",
    "回想": 1,
    "描述": "每长休一次，当你在攻击掷骰中骰出了关键成功，你和所有能够听见或看见你的盟友可以恢复1d4生命值或清除1d4压力值。",
    "卡图": "resource/领域/勇气/5振奋打击.png"
  },
  {
    "ID": "Rise_Up",
    "名称": "奋起",
    "领域": "勇气",
    "等级": 6,
    "属性": "能力",
    "回想": 2,
    "描述": "当这张卡处于你的配置中时，提升你的轻伤阈值，数值等同于你的熟练。",
    "卡图": "resource/领域/勇气/6奋起.png"
  },
  {
    "ID": "Inevitable",
    "名称": "命定",
    "领域": "勇气",
    "等级": 6,
    "属性": "能力",
    "回想": 1,
    "描述": "每当你在动作掷骰中失败时，你的下一次动作掷骰获得优势。",
    "卡图": "resource/领域/勇气/6命定.png"
  },
  {
    "ID": "Valor_Touched",
    "名称": "勇气恩泽",
    "领域": "勇气",
    "等级": 7,
    "属性": "能力",
    "回想": 1,
    "描述": "当你的配置（Loadout）的领域卡中勇气领域的卡片占多数时：\n当这张卡在你的配置中时，你的护甲值+2。\n每当你因为伤害失去1点或更多的生命值时，骰1d6，如果骰出了5或者更高的数值，你可以清除1点压力。",
    "卡图": "resource/领域/勇气/7勇气恩泽.png"
  },
  {
    "ID": "Shrug_it_off",
    "名称": "泰然自若",
    "领域": "勇气",
    "等级": 7,
    "属性": "能力",
    "回想": 1,
    "描述": "每当你将要受到伤害时，你可以标记1点压力将伤害降低一个阈值。当你这么做的时候，骰1d6，如果骰出了2或者更低的数值，将这张卡片放入你的宝库。\n（注：重伤3变损伤2，损伤2变轻伤1）",
    "卡图": "resource/领域/勇气/7泰然自若.png"
  },
  {
    "ID": "Full_Surge",
    "名称": "全力全开",
    "领域": "勇气",
    "等级": 8,
    "属性": "能力",
    "回想": 1,
    "描述": "每长休1次，标记3点压力将你的身体发挥至极限。你的所有角色属性+2，直到你的下一次休息。",
    "卡图": "resource/领域/勇气/8全力全开.png"
  },
  {
    "ID": "Ground_Pound",
    "名称": "震地一击",
    "领域": "勇气",
    "等级": 8,
    "属性": "能力",
    "回想": 2,
    "描述": "花费2点希望，打击你脚下的地面，并进行一次力量掷骰对抗所有邻近范围内的敌人。所有你对抗成功的目标会被击退至远距离，同时必须进行一次反应掷骰（17），如果其失败，其同时受到4d10伤害。如果其成功，其受到一半的伤害（向上取整）。",
    "卡图": "resource/领域/勇气/8震地一击.png"
  },
  {
    "ID": "Hold_the_Line",
    "名称": "维持战线",
    "领域": "勇气",
    "等级": 9,
    "属性": "能力",
    "回想": 1,
    "描述": "花费1点希望进入防御姿态直到你移动或骰出恐惧结果的失败。在这个姿态下，你警戒着以你为圆心的近距离范围区域。每当任何敌人踏入这个区域，其将会立即被拉至你的近战范围内并受到束缚。\n束缚状态只能由GM花费恐惧点解除。",
    "卡图": "resource/领域/勇气/9维持战线.png"
  },
  {
    "ID": "Lead_by_Example",
    "名称": "典范领导",
    "领域": "勇气",
    "等级": 9,
    "属性": "能力",
    "回想": 3,
    "描述": "每当你标记1点护甲槽，你可以选择一个可以看见或听见你的盟友使其获得1点希望或清除1点压力。",
    "卡图": "resource/领域/勇气/9典范领导.png"
  },
  {
    "ID": "Unbreakable",
    "名称": "坚不可摧",
    "领域": "勇气",
    "等级": 10,
    "属性": "能力",
    "回想": 4,
    "描述": "当你失去你的最后一点生命值，你可以骰1d6然后恢复等量的生命值以代替执行死亡行动。然后将此卡置入你的宝库。",
    "卡图": "resource/领域/勇气/10坚不可摧.png"
  }
];

module.exports = {
    勇气_CARDS
};