// 自动生成的领域卡牌文件
const 奥术_CARDS = [
  {
    "ID": "Unleash_Chaos",
    "名称": "施放混乱",
    "领域": "奥术",
    "等级": 1,
    "属性": "法术",
    "回想": 1,
    "描述": "在每局游戏开始时，在此卡上放置等同于你施法属性值的指示物。\n你可以进行一次施法掷骰以对抗一名远距离范围内的目标，同时花费任意数量的指示物，从你自身施放出一股狂野的能量以打击他们。如果成功，骰数量等同于你所花费的指示物数量的d10，对目标造成掷骰结果数量的魔法伤害。标记1点压力，将此卡上的指示物数量恢复至等同你施法属性值。在每局游戏结束后，清除所有指示物。",
    "卡图": "resource/领域/奥术/1施放混乱.png"
  },
  {
    "ID": "Rune_Ward",
    "名称": "符文护身符",
    "领域": "奥术",
    "等级": 1,
    "属性": "法术",
    "回想": 0,
    "描述": "你拥有一个非常个人化的徽章或小饰品，你在其中灌注了保护性的魔法，将其作为一个由你或者你的盟友持有的护身符。描述这个护身符的外观，以及它对你而言为什么如此重要。当该护身符的持有者受到伤害时，其可以花费1点希望将伤害减少1d8。\n如果护符骰（the ward die）骰出8，这枚护身符的力量将会在这个回合减少伤害后暂时性地消散。它可以在你的下一次休息中进行免费充能。",
    "卡图": "resource/领域/奥术/1符文护身符.png"
  },
  {
    "ID": "Wall_Walk",
    "名称": "墙壁行走",
    "领域": "奥术",
    "等级": 1,
    "属性": "法术",
    "回想": 1,
    "描述": "花费1点希望，使一个你可以触碰到的生物可以在墙壁以及天花板上行走，就如同在平地上一样。该效应持续到此次场景结束或你再次施放该法术在另一个生物上。",
    "卡图": "resource/领域/奥术/1墙壁行走.png"
  },
  {
    "ID": "Cinder_Grasp",
    "名称": "灰烬之握",
    "领域": "奥术",
    "等级": 2,
    "属性": "法术",
    "回想": 1,
    "描述": "进行一次施法掷骰对抗一个近战范围内的目标。如果成功，该目标立刻被火焰点燃，造成1d20+3魔法伤害并使他们暂时性地进入燃烧状态。\n在任何时候一个生物试图在燃烧状态下进行动作时，如果在动作结束时其仍然处于燃烧状态，其必须受到一次额外的2d6魔法伤害。",
    "卡图": "resource/领域/奥术/2灰烬之握.png"
  },
  {
    "ID": "Floating_Eye",
    "名称": "漂浮眼球",
    "领域": "奥术",
    "等级": 2,
    "属性": "法术",
    "回想": 0,
    "描述": "你可以花费1点希望以创造一个小型、漂浮的法球，你可以在极远范围内随意操控它。在操控室，你可以如同你自己的视野一般使用法球的视野进行观察。当法球受到伤害、或者移动出操控范围，该法术将会立刻中止。",
    "卡图": "resource/领域/奥术/2漂浮眼球.png"
  },
  {
    "ID": "CounterSpell",
    "名称": "法术反制",
    "领域": "奥术",
    "等级": 3,
    "属性": "法术",
    "回想": 1,
    "描述": "你可以中断一个法术或者正在发生的魔法效应，执行使用你的施法属性（Spellcast Trait）一次反应掷骰（Reaction Roll）。如果成功，该法术或魔法效应会立即停止，同时消除所有由此引发的后续效果，然后将这张卡放入你的宝库（Vault）。",
    "卡图": "resource/领域/奥术/3法术反制.png"
  },
  {
    "ID": "Flight",
    "名称": "飞行术",
    "领域": "奥术",
    "等级": 3,
    "属性": "法术",
    "回想": 1,
    "描述": "进行一次施法掷骰（15）。如果成功，将与你敏捷数值相同数量的指示物放置在这张卡上，最小为一。当你在飞行中进行动作时，从这张卡上移除一个标记。当你移除这张卡上最后一个指示物并且完成你的动作后，你降落在你正下方的地面上。",
    "卡图": "resource/领域/奥术/3飞行术.png"
  },
  {
    "ID": "Preservation_Blast",
    "名称": "防护爆发",
    "领域": "奥术",
    "等级": 4,
    "属性": "法术",
    "回想": 2,
    "描述": "进行一次施法掷骰对抗所有在你近战范围内的敌人。任何你对抗成功的敌人将会被击退至远距离并造成等同于你施法属性值的d8+3魔法伤害。",
    "卡图": "resource/领域/奥术/4防护爆发.png"
  },
  {
    "ID": "Blink_out",
    "名称": "闪烁",
    "领域": "奥术",
    "等级": 4,
    "属性": "法术",
    "回想": 1,
    "描述": "进行一次施法掷骰（12）。如果成功，花费1点希望使你在原地消失，并传送到另一个远距离范围内你能目视的地点。若你掷骰成功时有任意生物在你的邻近范围内，你可以为每个生物额外花费1点希望以携带他们一起传送。",
    "卡图": "resource/领域/奥术/4闪烁.png"
  },
  {
    "ID": "Chain_Lighting",
    "名称": "连锁闪电",
    "领域": "奥术",
    "等级": 5,
    "属性": "法术",
    "回想": 14,
    "描述": "使用一个动作并且标记2点压力来对在你近距离范围内的所有目标释放闪电。GM必须为每个目标进行一次反应掷骰（14）。如果失败，他们承受2d8+4魔法伤害。未成为连锁闪电目标且在先前目标近距离范围内的其他敌人也必须进行一次反应掷骰（14）。如果失败，他们承受2d8+4魔法伤害。此连锁持续进行直到没有更多有效敌人。一个敌人在一次动作中只能成为目标一次。",
    "卡图": "resource/领域/奥术/5连锁闪电.png"
  },
  {
    "ID": "Premonition",
    "名称": "预感",
    "领域": "奥术",
    "等级": 5,
    "属性": "法术",
    "回想": 2,
    "描述": "你可以引导一股奥术能量以窥视未来。每长休一次，当GM宣布你动作的掷骰结果时，你可以将其视为你的预感，立刻抹除此次动作以及此次动作所造成的后果，就如同其从未发生过一般，然后你选择执行另一个动作。",
    "卡图": "resource/领域/奥术/5预感.png"
  },
  {
    "ID": "Telekinesis",
    "名称": "念动力",
    "领域": "奥术",
    "等级": 6,
    "属性": "咒语",
    "回想": 0,
    "描述": "进行一次施法掷骰对抗一个远距离范围内的目标。如果成功，你可以用你的意念将其举起并移动至以其当前位置为圆心的远距离范围内的任意位置。如果你想使用被举起的目标进行投掷工具，进行一次额外的施法掷骰对抗你尝试攻击的目标。如果成功，造成等同你熟练的d12+4的物理伤害，之后该法术结束。",
    "卡图": "resource/领域/奥术/6念动力.png"
  },
  {
    "ID": "Rift_Walker",
    "名称": "裂隙行者",
    "领域": "奥术",
    "等级": 6,
    "属性": "咒语",
    "回想": 0,
    "描述": "进行一次施法掷骰（15）。如果成功，你可以将一枚奥术标记放置在你目前所站的位置。当你下一次成功释放裂隙行者时），会在当前空间打开一道裂隙，提供一个安全的通道以返回奥术标记所在的位置。你可以随时取消目前存在的奥术标记，并再次施放此法术以在新的地方放置奥术标记。\n裂缝会维持到你选择关闭它或你施放另一个法术。",
    "卡图": "resource/领域/奥术/6裂隙行者.png"
  },
  {
    "ID": "Arcana_Touched",
    "名称": "奥术恩泽",
    "领域": "奥术",
    "等级": 7,
    "属性": "能力",
    "回想": 2,
    "描述": "当你的配置（Loadout）的领域卡中奥术领域的卡片占多数时：\n你的施法掷骰+1\n每短休一次，交换你的希望骰和恐惧骰的骰值。",
    "卡图": "resource/领域/奥术/7奥术恩泽.png"
  },
  {
    "ID": "Cloaking_Blast",
    "名称": "潜伏打击",
    "领域": "奥术",
    "等级": 7,
    "属性": "咒语",
    "回想": 2,
    "描述": "在你成功进行一次法术掷骰以释放一个不同的法术后，你可以花费一点希望立即进入隐匿状态。\n隐匿状态持续到你下一次进行动作掷骰或GM使用完动作追踪器上的所有指示物时。",
    "卡图": "resource/领域/奥术/7潜伏打击.png"
  },
  {
    "ID": "Confusing_Aura",
    "名称": "迷离灵气",
    "领域": "奥术",
    "等级": 8,
    "属性": "法术",
    "回想": 2,
    "描述": "进行一次施法掷骰（14）。每长休一次，如果成功，你创造一层覆盖你全身的幻象，让他人很难察觉你确切的位置。你可以标记任意点压力以增加幻象的层数。当一名敌人以你为目标进行攻击时，骰等同于你当前激活的幻象层数的d6，若其中任意骰子骰出大于等于5的骰值，你避免此次伤害并摧毁一层幻象；若所有骰子皆骰出小于等于4的骰值，你受到伤害并中止此效应。",
    "卡图": "resource/领域/奥术/8迷离灵气.png"
  },
  {
    "ID": "Arcane_Reflection",
    "名称": "奥术反射",
    "领域": "奥术",
    "等级": 8,
    "属性": "法术",
    "回想": 1,
    "描述": "每当你受到魔法伤害时，你可以花费任意点希望，骰相同数量的d6。如果其中任意骰子骰出6，该法术伤害将会反弹回施放者，改为对他们自身造成伤害。",
    "卡图": "resource/领域/奥术/8奥术反射.png"
  },
  {
    "ID": "Earthquake",
    "名称": "地震术",
    "领域": "奥术",
    "等级": 9,
    "属性": "法术",
    "回想": 2,
    "描述": "进行一次施法掷骰（16）。每短休一次，如果成功，所有极远范围内的任何目标必须进行一次反应掷骰。若其失败，其受到3d10物理伤害并陷入脆弱状态；若其成功，其受到一半的伤害（向上取整）。\n每当你成功施放此法术时，极远范围内的所有地面都会变得难以走动，且范围内所有建筑结构将会受到损坏或者倒塌。",
    "卡图": "resource/领域/奥术/9地震术.png"
  },
  {
    "ID": "Sensory_Projection",
    "名称": "感官投射",
    "领域": "奥术",
    "等级": 9,
    "属性": "法术",
    "回想": 0,
    "描述": "每短休一次，进行一次施法掷骰（15）。如果成功，你可以进入一个可以让你能够清晰地看到和听到你曾经去过的地方在当下的状况的幻境，如同你在场一般。你可以在幻境中自由移动，并且不被任何物理实体限制或妨碍。此法术不能被任何物理或魔法手段所感知。在你受到伤害或施放另一个法术时，你会退出这个幻境。",
    "卡图": "resource/领域/奥术/9感官投射.png"
  },
  {
    "ID": "Falling_Sky",
    "名称": "堕天",
    "领域": "奥术",
    "等级": 10,
    "属性": "法术",
    "回想": 1,
    "描述": "进行一次施法掷骰对抗所有远距离范围内的敌人。标记任意点压力在战场上空生成由奥术碎片构成的暴雨，对所有你成功对抗的目标造成等同于你花费压力值总数的d10+2魔法伤害。",
    "卡图": "resource/领域/奥术/10堕天.png"
  }
];

module.exports = {
    奥术_CARDS
};