// 自动生成的领域卡牌文件
window.贤者_CARDS = [
  {
    "ID": "Vicious_Entangle",
    "名称": "恶性纠缠",
    "领域": "贤者",
    "等级": 1,
    "属性": "法术",
    "回想": 1,
    "描述": "进行一次施法掷骰对抗一名远距离范围内的目标。如果成功，根茎与滕蔓会从地底生长而出将目标暂时性地束缚，并对其造成1d8+1物理伤害。\n如果成功，你也可以花费1点希望以暂时性束缚在你目标邻近范围内、任意数量的敌人。",
    "卡图": "resource/领域/贤者/1恶性纠缠.png"
  },
  {
    "ID": "Gifted_Tracker",
    "名称": "天赋追踪者",
    "领域": "贤者",
    "等级": 1,
    "属性": "能力",
    "回想": 0,
    "描述": "进行一次施法掷骰，你可以根据一个或一群生物行进的痕迹进行追踪，亦或是向GM询问一个问题以了解关于他们的信息。如果在掷骰前你花费了1点希望，你在这次掷骰中获得优势 \n当你遭遇任何你追踪过的生物时，你对抗其的闪避+1。",
    "卡图": "resource/领域/贤者/1天赋追踪者.png"
  },
  {
    "ID": "s_Tongue",
    "名称": "自然之语",
    "领域": "贤者",
    "等级": 1,
    "属性": "法术",
    "回想": 0,
    "描述": "你能够使用一种隐蔽的、用于自然界的语言。当你想要与你身边的植物或是动物说话时，进行一次本能掷骰（12）。如果成功，他们将会把他们知道的信息告诉你。如果骰出恐惧结果，他们的信息可能会有局限或者需要少许代价才能得到。\n此外，每当你在自然环境中进行施法掷骰，你可以在掷骰前花费1点希望以在掷骰结果中+1。",
    "卡图": "resource/领域/贤者/1自然之语's Tongue.png"
  },
  {
    "ID": "Natural_Familiar",
    "名称": "自然伙伴",
    "领域": "贤者",
    "等级": 2,
    "属性": "法术",
    "回想": 1,
    "描述": "花费1点希望以召唤一个小型的自然精魂或森林小动物在你身旁，持续到你的下一次短休、你再次施放此法术或其受到伤害。如果你额外花费1点希望，其可以是一只可以飞行的伙伴。你可以与其交谈，或者进行一次施法掷骰以命令其执行简单的任务，或者标记1点压力以透过他们的眼睛进行观察。\n当该伙伴被召唤时，当你对一名“你的伙伴处于其近战范围内的目标造成伤害时，额外造成1d6物理伤害。",
    "卡图": "resource/领域/贤者/2自然伙伴.png"
  },
  {
    "ID": "Conjure_Swarm",
    "名称": "召唤虫群",
    "领域": "贤者",
    "等级": 2,
    "属性": "法术",
    "回想": 1,
    "描述": "特凯拉铁甲虫Tekaira Armored Beetles 标记1个压力使一群甲虫覆盖你的身体。你对你所遭受的下一次攻击具有抵抗。每当你以此法减少伤害时，甲虫群会解散，除非你花费1点希望以维持他们。\n萤火虫Fire Flies 进行一次施法掷骰对抗任意名在近距离范围内的敌人。如果成功，花费1点希望使萤火虫包围他们，对所有你成功对抗的目标造成2d8+3魔法伤害。",
    "卡图": "resource/领域/贤者/2召唤虫群.png"
  },
  {
    "ID": "Towering_Stalk",
    "名称": "茁壮枝茎",
    "领域": "贤者",
    "等级": 3,
    "属性": "法术",
    "回想": 1,
    "描述": "你可以在近距离范围内召唤一根粗壮、扭曲、让人能够非常轻松地攀爬的植物枝茎，其生长高度至多为远距离。\n当你召唤枝茎时，你可以同时标记1点压力以使用枝茎进行攻击。如果你这么做，进行一次施法掷骰对抗近距离范围内任意数量的目标。枝茎会从地底钻出，将所有你成功对抗的目标拉拽至半空然后将他们摔下，造成使用你熟练的d8物理伤害。",
    "卡图": "resource/领域/贤者/3茁壮枝茎.png"
  },
  {
    "ID": "Corrosive_Projectile",
    "名称": "腐蚀弹射",
    "领域": "贤者",
    "等级": 3,
    "属性": "法术",
    "回想": 1,
    "描述": "进行一次施法掷骰对抗一名远距离范围内的目标。如果成功，标记1点压力，等同于你熟练数的d6+4魔法伤害。该目标的难度值（Difficulty value）暂时性地-1。",
    "卡图": "resource/领域/贤者/3腐蚀弹射.png"
  },
  {
    "ID": "Healing_Field",
    "名称": "治疗之域",
    "领域": "贤者",
    "等级": 4,
    "属性": "法术",
    "回想": 2,
    "描述": "每长休一次，你可以使用一个动作在你身边以召唤一片小型的、有治愈功能的植被。在以你为圆心的近距离范围内都会变得生机勃勃，使你和你的盟友在这片区域内立刻恢复1点生命值。\n花费2点希望以强化该法术的治愈效果至恢复2点生命值。",
    "卡图": "resource/领域/贤者/4治疗之域.png"
  },
  {
    "ID": "Death_Grip",
    "名称": "死亡之握",
    "领域": "贤者",
    "等级": 4,
    "属性": "法术",
    "回想": 1,
    "描述": "选择下面的一个选项，并进行一次施法掷骰对抗一名近距离范围内的目标，如果成功，你的手中将会生长出藤蔓，造成你选择的效果并使目标陷入束缚状态。\n将目标拖拽至你的近战范围内，或将你自身拉至目标的进展范围内。\n收缩藤蔓，使目标标记2点压力。\n任何在你与目标之间的敌人必须进行一次反应掷骰（13），若失败则会被藤蔓击中造成3d6+2物理伤害。",
    "卡图": "resource/领域/贤者/4死亡之握.png"
  },
  {
    "ID": "Wild_Fortress",
    "名称": "荒野要塞",
    "领域": "贤者",
    "等级": 5,
    "属性": "法术",
    "回想": 1,
    "描述": "进行一次施法掷骰（13）以创造出一个圆顶状的自然屏障，供你以及至多一名盟友藏身于此。在屏障内藏身时，你视为隐匿状态，但你可以暴露自己在屏障顶部探出身子以进行攻击。该屏障拥有如下所示的伤害阈值，并且将持续到它失去3生命值时。在此卡上放置指示物以表示屏障失去的生命值。\n轻伤1 损伤 15 重伤30",
    "卡图": "resource/领域/贤者/5荒野要塞.png"
  },
  {
    "ID": "Thorn_Skin",
    "名称": "荆棘皮肤",
    "领域": "贤者",
    "等级": 5,
    "属性": "法术",
    "回想": 1,
    "描述": "每短休一次，花费1点希望并触碰一名自愿生物，在此卡上放置数量等同于你施法属性值的指示物。每当目标受到伤害时，你可以移除任意数量的指示物，并骰同等数量的d6，然后伤害减少等同于掷骰结果的数值。如果攻击者处于近战范围，对其造成数值等同于掷骰结果的伤害。\n当你休息时，清除所有指示物。",
    "卡图": "resource/领域/贤者/5荆棘皮肤.png"
  },
  {
    "ID": "Conjured_Steeds",
    "名称": "召唤坐骑",
    "领域": "贤者",
    "等级": 6,
    "属性": "咒语",
    "回想": 0,
    "描述": "花费1点希望以召唤一群魔法坐骑（马、骆驼、大象等）供你与你的盟友骑乘，数量等同于你的等级。这些坐骑会维持至你进行下一次长休或他们受到任意伤害。骑上坐骑会使你的陆地行进速度翻倍，且在危险状态下无需掷骰便可使你移动到远距离范围内的任意位置。所有在坐骑上执行的攻击掷骰都会-2，但是伤害掷骰+2。",
    "卡图": "resource/领域/贤者/6召唤坐骑.png"
  },
  {
    "ID": "Forager",
    "名称": "拾荒者",
    "领域": "贤者",
    "等级": 6,
    "属性": "能力",
    "回想": 1,
    "描述": "你可以把“拾荒”作为你的额外的休息行动选项。你可以骰1d6以发现你捡到了什么，与GM进行讨论并描述你的拾荒过程，然后将其作为一个消耗品放入你的背包中。\n你的队伍最多可以携带5个从该行动中获得的消耗品。\n1.一份独特的食物（消除2点压力）\n2.一件美丽的遗物（获得2点希望）\n3.一个奥术符文（施法掷骰+2）\n4.一小瓶治疗药水（恢复2点生命值）\n5.一个幸运护符（重骰所有二元骰或伤害骰）\n6.你可以从以上选项中选择一个",
    "卡图": "resource/领域/贤者/6拾荒者.png"
  },
  {
    "ID": "Sage_Touched",
    "名称": "贤者恩泽",
    "领域": "贤者",
    "等级": 7,
    "属性": "能力",
    "回想": 2,
    "描述": "当你的配置（Loadout）的领域卡中贤者领域的卡片占多数时：\n当你在自然环境中时，你的施法掷骰获得+2\n每短休一次，在你进行掷骰前，你的敏捷或本能属性值在本次掷骰中翻倍。",
    "卡图": "resource/领域/贤者/7贤者恩泽.png"
  },
  {
    "ID": "Wild_Surge",
    "名称": "狂野浪涌",
    "领域": "贤者",
    "等级": 7,
    "属性": "咒语",
    "回想": 2,
    "描述": "每长休一次，标记1点压力，引导你身边的自然环境，令其增强你的能力。描述你的外貌是如何改变的，然后在此卡上放置一个d6并使骰值为6。\n当你的狂野浪涌骰生效时，将其骰值加至你进行的所有动作掷骰中，在你将骰值加入到一次掷骰中后，将骰值-1。当骰值降低为0或你进行一次休息时，此效应结束且你须额外标记1点压力。",
    "卡图": "resource/领域/贤者/7狂野浪涌.png"
  },
  {
    "ID": "Rejuvenation_Barrier",
    "名称": "回春屏障",
    "领域": "贤者",
    "等级": 8,
    "属性": "咒语",
    "回想": 1,
    "描述": "进行一次施法掷骰（15）。如果成功，每短休一次，你可以创造一个临时的、充满保护性能量的屏障包围着你。你和所有邻近范围内的盟友在此法术第一次施放时恢复1d4点生命值。在屏障生效期间，你和所有在屏障内的盟友获得物理伤害的抗性。\n此屏障会跟随你移动。",
    "卡图": "resource/领域/贤者/8回春屏障.png"
  },
  {
    "ID": "Forest_Sprites",
    "名称": "森林精魂",
    "领域": "贤者",
    "等级": 8,
    "属性": "咒语",
    "回想": 2,
    "描述": "进行一次施法掷骰（13）。如果成功，你可以花费任意数量的希望并创造等量的小型森林精魂，使其出现在远距离范围内的任意位置，以分散敌人的注意力以及帮助你的盟友。描述它们的形态。\n攻击在精魂近战范围内的敌人时，攻击掷骰+3；在精魂近战范围的任意盟友在标记护甲槽时，护甲值+3。\n精魂将在执行增益效果后或受到伤害后消散。",
    "卡图": "resource/领域/贤者/8森林精魂.png"
  },
  {
    "ID": "Plant_Dominion",
    "名称": "植物支配",
    "领域": "贤者",
    "等级": 9,
    "属性": "咒语",
    "回想": 1,
    "描述": "进行一次施法掷骰（18）。如果成功，你可以重塑自然环境，改变你极远范围内的植物形态，如使树木瞬间生长、在茂密的藤蔓中清理处道路，创造一面由树根构成的墙壁等。\n如果你创造了一个恶劣的自然环境，任何试图走入或穿过环境的人将会受到3d10+7物理伤害。",
    "卡图": "resource/领域/贤者/9植物支配.png"
  },
  {
    "ID": "Fane_of_the_Wilds",
    "名称": "荒野神殿",
    "领域": "贤者",
    "等级": 9,
    "属性": "能力",
    "回想": 2,
    "描述": "在一次长休后，于此卡上放置数量等同于你配置与宝库中贤者领域卡数量的指示物。\n每当你将要进行一次施法掷骰时，你可以花费任意数量的指示物，每个指示物使该次掷骰+1。\n每当你在贤者领域咒语的施法掷骰中骰出关键成功时，获得1个指示物。\n当你进行长休时，移除所有指示物。",
    "卡图": "resource/领域/贤者/9荒野神殿.png"
  },
  {
    "ID": "Tempest",
    "名称": "风暴",
    "领域": "贤者",
    "等级": 10,
    "属性": "法术",
    "回想": 2,
    "描述": "选择以下一种风暴，进行一次施法掷骰对抗所有远距离范围内的目标。任何你成功对抗的目标将会经受你选择的风暴所带来的效应，直到GM花费1点恐惧中止：\n暴风雪Blizzard 造成2d20+8魔法伤害，并使其陷入脆弱状态。\n龙卷风Hurricane 造成3d10+10魔法伤害，选择一个风向，目标不能逆风向移动。\n沙尘暴Sandstrom 造成5d6+9魔法伤害，且非近战范围内发起的攻击处于劣势。",
    "卡图": "resource/领域/贤者/10风暴.png"
  }
];

window.贤者_CARDS = 贤者_CARDS;