// 自动生成的领域卡牌文件
const 辉耀_CARDS = [
  {
    "ID": "Bolt_Beacon",
    "名称": "闪光信标",
    "领域": "辉耀",
    "等级": 1,
    "属性": "法术",
    "回想": 1,
    "描述": "进行一次施法掷骰，对抗一名远距离范围内的目标。如果成功，你可以花费1点希望向目标发射一道视为远程武器的炫目闪光，造成使用你的熟练值的d8+2的魔法伤害，同时让他们发出亮光，暂时性地使他们陷入脆弱（Vulnerable）。\n（注：原文是dealing d8 magic damage using your proficiency that makes them glow brightly and become temporarily Vulnerable，应该是等同于你熟练数值个d8骰的伤害，不然和基础数学模型对不上，如果只有1d8会正确地标注使用骰子的确切数量，如果只有骰子类型则其数量会根据状况进行浮动，等正式版调整文本。）",
    "卡图": "resource/领域/辉耀/1闪光信标.png"
  },
  {
    "ID": "Mending_Touch",
    "名称": "修复之触",
    "领域": "辉耀",
    "等级": 1,
    "属性": "法术",
    "回想": 1,
    "描述": "你触碰一名生物并引导治愈魔法帮助他愈合伤口。当你可以花费数分钟帮助一名生物时（译者注：Matthew说过这是个非战斗能力，应该主要是用于战斗后但是还没开始长短休的情况，而且可以随便乱摸任意队友——只要你有足够的希望点），花费2点希望以恢复1点生命值或压力值。\n每长休1次，当你在治疗时学到了新东西，或者向你的队友揭示了关于你的事情，你在此次治疗花费的2点希望改为恢复2点生命值或压力值。\n（注：Daggerheart对RP的要求比较高，很多职业或者领域卡的额外效果都是靠合适的RP来达成条件的。）",
    "卡图": "resource/领域/辉耀/1修复之触.png"
  },
  {
    "ID": "Reassurance",
    "名称": "宽慰言语",
    "领域": "辉耀",
    "等级": 1,
    "属性": "能力",
    "回想": 0,
    "描述": "每短休一次，每当一名盟友将要进行一次动作掷骰，在结果生效前，你可以提供帮助或者鼓励，让其再进行一次掷骰。其必须接受掷骰的新结果。",
    "卡图": "resource/领域/辉耀/1宽慰言语.png"
  },
  {
    "ID": "Healing_Hands",
    "名称": "治愈之手",
    "领域": "辉耀",
    "等级": 2,
    "属性": "法术",
    "回想": 1,
    "描述": "进行一次施法掷骰（13），选择一名除你以外的在你近战范围（Melee）的目标。如果成功，标记1点压力值然后使目标恢复2点生命值或压力值。如果失败，标记1点压力值然后使目标恢复1点生命值或压力值。直到下次长休，你不能对相同的目标再次施放此法术",
    "卡图": "resource/领域/辉耀/2治愈之手.png"
  },
  {
    "ID": "Final_Words",
    "名称": "临终遗言",
    "领域": "辉耀",
    "等级": 2,
    "属性": "法术",
    "回想": 1,
    "描述": "进行一次施法掷骰（13）。如果成功，你可以为一具尸体注入少许生命以便你能够与其对话。如果骰出希望结果，它会回答至多3个问题。如果骰出恐惧结果，它只能回答一个问题。当法术结束或者施法失败时，尸体会化为尘埃。",
    "卡图": "resource/领域/辉耀/2临终遗言.png"
  },
  {
    "ID": "Second_Wind",
    "名称": "复苏之风",
    "领域": "辉耀",
    "等级": 3,
    "属性": "能力",
    "回想": 2,
    "描述": "每短休1次，每当你成功击中一名敌人，你可以清除3点压力值或者恢复1点生命值。如果是骰出希望结果的成功，你可以同时为一名在你的近距离范围内的盟友清除3点压力值或者恢复1点生命值。",
    "卡图": "resource/领域/辉耀/3复苏之风.png"
  },
  {
    "ID": "Conviction",
    "名称": "坚定信念",
    "领域": "辉耀",
    "等级": 3,
    "属性": "能力",
    "回想": 1,
    "描述": "你带着无与伦比的威压和优雅进行交谈。当你试图使用这种正直来缓解冲突与暴力，或者让某人跟随着你时，你的掷骰获得优势。\n你的信念亦赋予你面对威胁的勇气。当你的所有压力值被标记时，你的伤害掷骰+1熟练。",
    "卡图": "resource/领域/辉耀/3坚定信念.png"
  },
  {
    "ID": "Life_Ward",
    "名称": "生命守卫",
    "领域": "辉耀",
    "等级": 4,
    "属性": "法术",
    "回想": 1,
    "描述": "使用一个动作，花费3点希望并选择一名近距离范围的盟友。他们将会被一个闪耀的保护法印所标记。每当该盟友因任意理由被要求执行一次死亡行动（Death Move）时，其可以无视之并恢复1点生命。\n该法术将会在避免一次死亡行动后、再次施放于其他目标以及执行长休时结束。",
    "卡图": "resource/领域/辉耀/4生命守卫.png"
  },
  {
    "ID": "Divination",
    "名称": "占卜",
    "领域": "辉耀",
    "等级": 4,
    "属性": "法术",
    "回想": 1,
    "描述": "每长休一次，你可以花费3点希望来联系某个遥远存在，询问一个关于事件、人物、地点或者未来情况的问题。你的感官将会被暂时性地扭曲以显示答案，答案可能是模糊的、被遮掩的或者是不完整的。",
    "卡图": "resource/领域/辉耀/4占卜.png"
  },
  {
    "ID": "Shape_Material",
    "名称": "物质塑形",
    "领域": "辉耀",
    "等级": 5,
    "属性": "法术",
    "回想": 1,
    "描述": "使用一个动作并花费1点希望以改变一个你所触碰的自然物体（比如石头、冰、木头等）使其变成你想要的形态。该物体的尺寸需小于你。例如你可以用来制作基本工具、武器，或者在物体上创造出门、通道，等等。\n你只能影响在近距离范围内你所能够触碰的物体。\n（注：原文是Mark a Hope，估计是因为beta原因很多用词都没统一，有用spend的也有用cost的，这里应该还是花费）",
    "卡图": "resource/领域/辉耀/5物质塑形.png"
  },
  {
    "ID": "Smite",
    "名称": "惩击",
    "领域": "辉耀",
    "等级": 5,
    "属性": "法术",
    "回想": 2,
    "描述": "花费3点希望以准备一次强有力的打击。当你的下一次攻击成功时，将你应用在伤害骰上的熟练值翻倍，这次攻击造成魔法伤害（无视该武器原本的伤害类型）。",
    "卡图": "resource/领域/辉耀/5惩击.png"
  },
  {
    "ID": "Zone_of_Protection",
    "名称": "保护之域",
    "领域": "辉耀",
    "等级": 6,
    "属性": "法术",
    "回想": 2,
    "描述": "进行一次施法掷骰（16），如果成功，每长休一次，你可以指定在远距离范围内的一点创造一个可见的、大小为邻近范围的保护之域。当你这么做时，在这张卡上放置一个d8并将其设置为最高值。每当在保护之域内的盟友受到伤害时，自动减少等同于d8骰面值上的伤害数，然后将其-1。这个法术会在骰值降为0时结束。\n（注：意思是在以你为圆心半径30-100尺的范围内选择一个点，再以此点为圆心创造一个直径为5-10尺的保护区域。Matthew解释过如何快速在地图板上确定距离：一张卡牌的长大概是邻近Very Close指代5-10尺，一支铅笔的长度大概是近距离Close指代10-30尺，一张A4纸的长度是远距离Far指代30-100尺，在此之外但是在地图板上就是极远Very Far指代100-300尺）",
    "卡图": "resource/领域/辉耀/6保护之域.png"
  },
  {
    "ID": "Restoration",
    "名称": "复原术",
    "领域": "辉耀",
    "等级": 6,
    "属性": "法术",
    "回想": 2,
    "描述": "在一次长休后，放置等同于你施法属性值数量的指示物在此卡上。作为一个动作，你可以触碰一个生物并花费任意个指示物以恢复其生命，花费的每个指示物可恢复2点生命值。你也可以花费1个动作和1个指示物在触碰一个生物时清除1点压力，结束脆弱状态，一个疾病或者一个魔法疾病（GM可能会根据严重程度要求额外的指示物）。\n当你进行长休时，清除所有指示物。\n（注：也就意味着在战斗中每一次治疗都会被算作一次动作，从而让dm在他的回合获得一次动作。）",
    "卡图": "resource/领域/辉耀/6复原术.png"
  },
  {
    "ID": "Splendor_Touched",
    "名称": "辉耀恩泽",
    "领域": "辉耀",
    "等级": 7,
    "属性": "能力",
    "回想": 2,
    "描述": "当你的配置（Loadout）的领域卡中辉耀领域的卡片占多数时：\n你的损伤阈值+3\n每长休一次，当即将到来的伤害要求你失去若干生命值时，你可以选择标记等量的压力值或花费等量的希望点来替代。",
    "卡图": "resource/领域/辉耀/7辉耀恩泽.png"
  },
  {
    "ID": "Healing_Strike",
    "名称": "治愈打击",
    "领域": "辉耀",
    "等级": 7,
    "属性": "法术",
    "回想": 1,
    "描述": "每当你对一名敌人造成伤害时，你可以选择花费1点希望为近距离范围内的盟友恢复1点生命值。",
    "卡图": "resource/领域/辉耀/7治愈打击.png"
  },
  {
    "ID": "Stunning_Sunlight",
    "名称": "炫目日光",
    "领域": "辉耀",
    "等级": 8,
    "属性": "法术",
    "回想": 2,
    "描述": "进行一次法术掷骰，对抗任意数量、站在你面前、远距离范围内的敌人。你施放出一道强有力的日光射线，为每名你对抗成功且希望其被影响的目标花费1点希望，然后他们必须进行一次反应掷骰（14）。\n如果成功，他们受到4d20+5魔法伤害。\n如果失败，他们受到4d20+5魔法伤害并进入晕眩状态，他们将不能进行行动，直到状态被清除。",
    "卡图": "resource/领域/辉耀/8炫目日光.png"
  },
  {
    "ID": "Shield_Aura",
    "名称": "护盾灵气",
    "领域": "辉耀",
    "等级": 8,
    "属性": "法术",
    "回想": 2,
    "描述": "标记1点压力，对一个你可以触碰到的目标施放护盾灵气。每当目标准备使用一个护甲槽的时候，骰d12，然后将结果加到其护甲值上。如果d12结果大于等于其当前等级，该法术中止。如果d12结果小于其当前等级，该法术持续生效。",
    "卡图": "resource/领域/辉耀/8护盾灵气.png"
  },
  {
    "ID": "Overwhelming_Aura",
    "名称": "威压灵气",
    "领域": "辉耀",
    "等级": 9,
    "属性": "法术",
    "回想": 2,
    "描述": "进行一次施法掷骰（15），以暂时性增强你的风采。如果成功，花费2点希望使你的风采属性值等同于你的施法属性值直到你的下一次长休。\n当威压灵气激活时，GM总是必须花费1点压力来使你成为攻击目标。",
    "卡图": "resource/领域/辉耀/9威压灵气.png"
  },
  {
    "ID": "Salvation_Beam",
    "名称": "救赎光束",
    "领域": "辉耀",
    "等级": 9,
    "属性": "法术",
    "回想": 2,
    "描述": "进行一次施法掷骰（16）。如果成功，标记任意数量的压力，为站在一条长度为远距离的光束下的所有友军恢复总量为标记压力数量的的生命值，按照你的意愿来分配这次治疗的治疗量",
    "卡图": "resource/领域/辉耀/9救赎光束.png"
  },
  {
    "ID": "Invigoration",
    "名称": "壮举再现",
    "领域": "辉耀",
    "等级": 10,
    "属性": "法术",
    "回想": 4,
    "描述": "当你或者近距离范围内的盟友使用了一个带有力竭限制的能力或法术时（比如每长休一次、每短休一次等），你和你的盟友可以选择花费任意点希望，骰同等数量的d6。骰出一个6，该能力或法术的可以重新被使用。\n该法术不会作用在任何你已经永久置入宝库的能力或法术。",
    "卡图": "resource/领域/辉耀/10壮举再现.png"
  }
];

module.exports = {
    辉耀_CARDS
};