// 自动生成的领域卡牌文件
const 骸骨_CARDS = [
  {
    "ID": "Deft_Maneuvers",
    "名称": "灵巧动作",
    "领域": "骸骨",
    "等级": 1,
    "属性": "能力",
    "回想": 0,
    "描述": "你可以标记1点压力移动到远距离范围内的任意位置，而不需要进行敏捷掷骰。",
    "卡图": "resource/领域/骸骨/1灵巧动作.png"
  },
  {
    "ID": "Untouchable",
    "名称": "不可触碰",
    "领域": "骸骨",
    "等级": 1,
    "属性": "能力",
    "回想": 1,
    "描述": "当此卡处于你的配置中时，将你敏捷属性值的一半加至你的闪避值中（向上取整）。",
    "卡图": "resource/领域/骸骨/1不可触碰.png"
  },
  {
    "ID": "I_See_it_Coming",
    "名称": "先见之明",
    "领域": "骸骨",
    "等级": 1,
    "属性": "能力",
    "回想": 1,
    "描述": "每当你成为一次在非近战距离内（beyond melee range）发起的攻击的目标时。标记1点压力并骰一个d4，将结果加至你对抗此次攻击的闪避值中。",
    "卡图": "resource/领域/骸骨/1先见之明.png"
  },
  {
    "ID": "Strategic_Approach",
    "名称": "战术方针",
    "领域": "骸骨",
    "等级": 2,
    "属性": "能力",
    "回想": 1,
    "描述": "在一次长休后，在此卡上放置等同于你知识属性值数的指示物，最少为1。当你进入一个敌人的近战范围并对其进行攻击掷骰时，你可以花费一个指示物来选择下列选项中的一个。\n·使这次攻击获得优势\n·消除1个在这个敌人近战范围内的盟友身上的压力\n·伤害增加1d8\n当你进行长休时，清除所有未使用的指示物",
    "卡图": "resource/领域/骸骨/2战术方针.png"
  },
  {
    "ID": "Ferocity",
    "名称": "残虐",
    "领域": "骸骨",
    "等级": 2,
    "属性": "能力",
    "回想": 2,
    "描述": "每当你使一名敌人失去生命值时，你可以花费2点希望暂时性地提高自己的闪避值，数量等同于你此次使敌人失去的生命值数量。这项增益持续到你下一次被指定为攻击目标后。",
    "卡图": "resource/领域/骸骨/2残虐.png"
  },
  {
    "ID": "Brace",
    "名称": "鼓起勇气",
    "领域": "骸骨",
    "等级": 3,
    "属性": "能力",
    "回想": 1,
    "描述": "每当你使用1点护甲槽以减少即将到来的伤害时，你也可以同时花费任意数量的希望。对于你花费的每1点希望而言，减少等同于你熟练值的伤害。",
    "卡图": "resource/领域/骸骨/3鼓起勇气.png"
  },
  {
    "ID": "Tactician",
    "名称": "战术家",
    "领域": "骸骨",
    "等级": 3,
    "属性": "能力",
    "回想": 1,
    "描述": "当你帮助一名盟友时，他们可以将你的一项经历加值同时添加到他们的掷骰中。当进行接力掷骰时，你可以将你的希望骰改为d20，而不是d12。",
    "卡图": "resource/领域/骸骨/3战术家.png"
  },
  {
    "ID": "Boost",
    "名称": "起飞",
    "领域": "骸骨",
    "等级": 4,
    "属性": "能力",
    "回想": 1,
    "描述": "当有一个盟友处于你的近距离范围内，你可以标记1点压力以他们为跳板跃至空中，对远距离范围内的一名敌人进行一次空中打击。你的这次攻击掷骰具有优势，在伤害掷骰中增加1d10，然后你在被攻击目标的近战范围内结束你的动作。",
    "卡图": "resource/领域/骸骨/4起飞.png"
  },
  {
    "ID": "Redirect",
    "名称": "重新定向",
    "领域": "骸骨",
    "等级": 4,
    "属性": "能力",
    "回想": 1,
    "描述": "当你成功闪避一次来自非近战距离内（beyond melee range）发起的攻击时，你可以骰等同于你熟练数的d6。若骰出6，标记1点压力并将此次攻击转移至一名在你邻近距离内的敌人。",
    "卡图": "resource/领域/骸骨/4重新定向.png"
  },
  {
    "ID": "Signature_Move",
    "名称": "招牌动作",
    "领域": "骸骨",
    "等级": 5,
    "属性": "能力",
    "回想": 1,
    "描述": "每短休一次，你可以在战斗中施展你的招牌动作。为你的招牌动作取一个名字并描述它的细节。如果你执行的动作包括了你招牌动作所描述的细节，你可以将你的希望骰改为d20，而不是d12。如果该动作成功，你可以消除1点压力。",
    "卡图": "resource/领域/骸骨/5招牌动作.png"
  },
  {
    "ID": "Know_thy_enemy",
    "名称": "洞悉汝敌",
    "领域": "骸骨",
    "等级": 5,
    "属性": "能力",
    "回想": 1,
    "描述": "当你观察一个生物时，你可以进行一次本能掷骰与其对抗，如果成功，花费1点希望以询问GM两个以下关于该生物的细节：\n该生物目前的生命值和压力值\n该生物的难度和伤害阈值\n该生物的战术（tactics）和标准伤害骰\n该生物的可以执行的行动（moves）和经历（Experiences）\n且如果成功，你也可以标记1点压力以从GM的恐惧池中移除1点恐惧。",
    "卡图": "resource/领域/骸骨/5洞悉汝敌.png"
  },
  {
    "ID": "Rapid_Riposte",
    "名称": "迅速报复",
    "领域": "骸骨",
    "等级": 6,
    "属性": "能力",
    "回想": 0,
    "描述": "当你成功闪避一次来自近战距离内发起的攻击时，你可以标记1点压力，对攻击者造成基于你当前持有武器的伤害。",
    "卡图": "resource/领域/骸骨/6迅速报复.png"
  },
  {
    "ID": "Recovery",
    "名称": "恢复",
    "领域": "骸骨",
    "等级": 6,
    "属性": "能力",
    "回想": 1,
    "描述": "在短休中，你可以改为选择执行一项长休选项。你可以花费1点希望，让你的一名队友也如此做。",
    "卡图": "resource/领域/骸骨/6恢复.png"
  },
  {
    "ID": "Bone_Touched",
    "名称": "骸骨恩泽",
    "领域": "骸骨",
    "等级": 7,
    "属性": "能力",
    "回想": 2,
    "描述": "当你的配置（Loadout）的领域卡中骸骨领域的卡片占多数时：\n你的敏捷+1\n每短休一次，在战斗中执行一次不需要在动作指示器上放置指示物的动作。",
    "卡图": "resource/领域/骸骨/7骸骨恩泽.png"
  },
  {
    "ID": "Cruel_Precision",
    "名称": "残酷精准",
    "领域": "骸骨",
    "等级": 7,
    "属性": "能力",
    "回想": 1,
    "描述": "当你使用武器进行一次成功的攻击时，将你的灵巧或敏捷属性值加至伤害中。",
    "卡图": "resource/领域/骸骨/7残酷精准.png"
  },
  {
    "ID": "Breaking_Blow",
    "名称": "突破打击",
    "领域": "骸骨",
    "等级": 8,
    "属性": "能力",
    "回想": 3,
    "描述": "当你进行一次成功的攻击时，你可以标记1点压力，使你下一次对相同目标的成功攻击造成额外2d12伤害。",
    "卡图": "resource/领域/骸骨/8突破打击.png"
  },
  {
    "ID": "Wrangle",
    "名称": "胡搅蛮缠",
    "领域": "骸骨",
    "等级": 8,
    "属性": "能力",
    "回想": 3,
    "描述": "进行一次敏捷掷骰对抗所有在你近距离范围内的敌人。你可以花费1点希望，在近距离范围内移动任意你成功对抗的敌人的位置。\n这次敏捷掷骰不会在动作追踪器上放置指示物。",
    "卡图": "resource/领域/骸骨/8胡搅蛮缠.png"
  },
  {
    "ID": "On_the_Brink",
    "名称": "生死边缘",
    "领域": "骸骨",
    "等级": 9,
    "属性": "能力",
    "回想": 1,
    "描述": "当你仅剩1点生命值时，忽略任何低于你损伤阈值的伤害。",
    "卡图": "resource/领域/骸骨/9生死边缘.png"
  },
  {
    "ID": "Splintering_Strike",
    "名称": "分裂打击",
    "领域": "骸骨",
    "等级": 9,
    "属性": "能力",
    "回想": 3,
    "描述": "花费1点希望并进行一次攻击掷骰，对抗所有在你武器攻击范围内的敌人。如果成功对抗其中至少一名敌人，每长休一次，你可以选择将伤害按照你的意愿分配至所有你成功对抗的敌人上。对于每一个你造成伤害的敌人，投掷一个额外的伤害骰并加在伤害值上。",
    "卡图": "resource/领域/骸骨/9分裂打击.png"
  },
  {
    "ID": "Serenity",
    "名称": "心如止水",
    "领域": "骸骨",
    "等级": 10,
    "属性": "能力",
    "回想": 1,
    "描述": "在你成功闪避一次攻击后，你可以消除1点压力。当你成功闪避一次攻击且没有压力可清除，改为获得1点希望。",
    "卡图": "resource/领域/骸骨/10心如止水.png"
  }
];

module.exports = {
    骸骨_CARDS
};