const races = [
    {
        "id": "Clank-1",
        "名称": "定制设计",
        "种族": "械灵",
        "描述": "决定你是由谁创造以及为何目的而创造的。选择一个反映这一点的经历，并将其增加+1。",
        "卡图": "resource/种族/械灵.png"
    },
    {
        "id": "Clank-2",
        "名称": "高效",
        "种族": "械灵",
        "描述": "当你进行短休时，你可以用一个长休行动替换你的短休行动之一。",
        "卡图": "resource/种族/械灵.png"
    },
    {
        "id": "Daemon-1",
        "名称": "无所畏惧",
        "种族": "恶魔",
        "描述": "当你骰出恐惧结果时，你可以标记2点压力，将其转换为希望结果。",
        "卡图": "resource/种族/恶魔.png"
    },
    {
        "id": "Daemon-2",
        "名称": "恐怖面容",
        "种族": "恶魔",
        "描述": "你在恐吓敌对目标的掷骰中具有优势。",
        "卡图": "resource/种族/恶魔.png"
    },
    {
        "id": "Drakona-1",
        "名称": "鳞片",
        "种族": "龙人",
        "描述": "你的天然鳞片起到保护作用，使你的所有伤害阈值+1。",
        "卡图": "resource/种族/龙人.png"
    },
    {
        "id": "Drakona-2",
        "名称": "元素吐息",
        "种族": "龙人",
        "描述": "选择你的吐息元素（冰、火、电等）。你可以在邻近距离内对单个目标或一群目标使用这种吐息，将其视为一种本能武器（以你的本能属性值进行调整），造成等同于你的熟练的d8魔法伤害。",
        "卡图": "resource/种族/龙人.png"
    },
    {
        "id": "Dwarf-1",
        "名称": "强化耐力",
        "种族": "矮人",
        "描述": "你可以花费3点希望来将受到的物理伤害减半。",
        "卡图": "resource/种族/矮人.png"
    },
    {
        "id": "Dwarf-2",
        "名称": "厚皮",
        "种族": "矮人",
        "描述": "当你受到轻伤Minor Damage时，骰d6，若结果大于等于5，则你改为不受到任何伤害。",
        "卡图": "resource/种族/矮人.png"
    },
    {
        "id": "Elf-1",
        "名称": "快速反应",
        "种族": "精灵",
        "描述": "你可以标记1点压力以在反应掷骰中获得优势。",
        "卡图": "resource/种族/精灵.png"
    },
    {
        "id": "Elf-2",
        "名称": "天界冥想",
        "种族": "精灵",
        "描述": "在休息时，你可以进入冥想状态，额外进行一次休息行动。",
        "卡图": "resource/种族/精灵.png"
    },
    {
        "id": "Faerie-1",
        "名称": "翅膀",
        "种族": "仙灵",
        "描述": "你可以飞行。在飞行时，可以在敌人的攻击掷骰前标记1点压力，在对抗该攻击时增加你的闪避值+2。",
        "卡图": "resource/种族/仙灵.png"
    },
    {
        "id": "Faerie-2",
        "名称": "幸运操控者",
        "种族": "仙灵",
        "描述": "每局游戏一次，在你或近距离范围内的盟友进行动作掷骰后，你可以花费3点希望重新掷二元骰。你必须接受新的结果。",
        "卡图": "resource/种族/仙灵.png"
    },
    {
        "id": "Faun-1",
        "名称": "跳跃",
        "种族": "羊蹄人",
        "描述": "你可以轻松地跳过近距离的跨越缺口或峡谷，无需进行敏捷掷骰。",
        "卡图": "resource/种族/羊蹄人.png"
    },
    {
        "id": "Faun-2",
        "名称": "踢击",
        "种族": "羊蹄人",
        "描述": "在成功进行近战攻击时，你可以标记1点压力，将自己从目标处踢开，向伤害中添加2d6，并将对方或自己推出近战范围之外。",
        "卡图": "resource/种族/羊蹄人.png"
    },
    {
        "id": "Firbolg-1",
        "名称": "自然平静",
        "种族": "费尔伯格",
        "描述": "每当你应该标记压力时，掷一个d6。如果结果为6，则不必标记压力。",
        "卡图": "resource/种族/费尔伯格.png"
    },
    {
        "id": "Firbolg-2",
        "名称": "冲锋",
        "种族": "费尔伯格",
        "描述": "当你在敏捷掷骰成功，从远或极远距离移动至与一个或多个目标的近战范围内时，标记1点压力，对所有目标造成1d12物理伤害。",
        "卡图": "resource/种族/费尔伯格.png"
    },
    {
        "id": "Fungril-1",
        "名称": "孢菌网络",
        "种族": "孢菌人",
        "描述": "你可以进行一次本能掷骰（12）以使用你的菌丝网络与任何距离内的同种族成员进行交谈。",
        "卡图": "resource/种族/孢菌人.png"
    },
    {
        "id": "Fungril-2",
        "名称": "死亡连接",
        "种族": "孢菌人",
        "描述": "在触摸一具最近死亡的尸体时，你可以标记1点压力，提取与特定情绪或感觉相关的一个记忆。",
        "卡图": "resource/种族/孢菌人.png"
    },
    {
        "id": "Galapa-1",
        "名称": "保护之壳",
        "种族": "龟人",
        "描述": "你的壳是天然的盾牌。将你的熟练加入到护甲值上。",
        "卡图": "resource/种族/龟人.png"
    },
    {
        "id": "Galapa-2",
        "名称": "缓慢而稳定",
        "种族": "龟人",
        "描述": "在战斗中，你可以通过在动作追踪器上放置一个额外的标记，来使你的该次攻击骰具有优势。",
        "卡图": "resource/种族/龟人.png"
    },
    {
        "id": "Giant-1",
        "名称": "耐力",
        "种族": "巨人",
        "描述": "在角色创建时，获得额外的1点生命值。",
        "卡图": "resource/种族/巨人.png"
    },
    {
        "id": "Giant-2",
        "名称": "长臂",
        "种族": "巨人",
        "描述": "若任意武器、特性、能力或法术范围为近战（Melee），你可以将其视为邻近（Very Close）。",
        "卡图": "resource/种族/巨人.png"
    },
    {
        "id": "Goblin-1",
        "名称": "危险感应",
        "种族": "哥布林",
        "描述": "每短休一次，标记1点压力值，使一个敌人对你或你身边的极近距离内的盟友重新进行一次攻击掷骰。",
        "卡图": "resource/种族/哥布林.png"
    },
    {
        "id": "Goblin-2",
        "名称": "稳健脚步",
        "种族": "哥布林",
        "描述": "你无视敏捷投掷中劣势。",
        "卡图": "resource/种族/哥布林.png"
    },
    {
        "id": "Halfling-1",
        "名称": "青春精神",
        "种族": "半身人",
        "描述": "在每局游戏开始时，给予你队伍中的每个人1点希望。",
        "卡图": "resource/种族/半身人.png"
    },
    {
        "id": "Halfling-2",
        "名称": "小幸运",
        "种族": "半身人",
        "描述": "当你掷出的希望骰为1时，你可以重骰一次，并且必须接受新的结果。",
        "卡图": "resource/种族/半身人.png"
    },
    {
        "id": "Human-1",
        "名称": "高耐力",
        "种族": "人类",
        "描述": "在角色创建时，获得一个额外的压力槽位。",
        "卡图": "resource/种族/人类.png"
    },
    {
        "id": "Human-2",
        "名称": "适应力",
        "种族": "人类",
        "描述": "当你使用经历的掷骰失败时，你可以标记1点压力来重新掷骰。你必须接受新的结果。",
        "卡图": "resource/种族/人类.png"
    },
    {
        "id": "Katari-1",
        "名称": "猫科本能",
        "种族": "猫族",
        "描述": "当你进行敏捷掷骰时，你可以标记一个压力来重新投掷你的希望骰。你必须接受新的结果。",
        "卡图": "resource/种族/猫族.png"
    },
    {
        "id": "Katari-2",
        "名称": "伸缩爪子",
        "种族": "猫族",
        "描述": "你可以进行一次敏捷掷骰以在近战范围内抓挠一名目标。若你成功，其陷入脆弱（Vulnerable）状态。",
        "卡图": "resource/种族/猫族.png"
    },
    {
        "id": "Orc-1",
        "名称": "强壮",
        "种族": "兽人",
        "描述": "当你剩余1点生命值时，你的护甲值翻倍。",
        "卡图": "resource/种族/兽人.png"
    },
    {
        "id": "Orc-2",
        "名称": "獠牙",
        "种族": "兽人",
        "描述": "在成功进行近战攻击后，你可以花费1点希望，同时用你的獠牙刺穿目标，为伤害掷骰增加1d6。",
        "卡图": "resource/种族/兽人.png"
    },
    {
        "id": "Ribbet-1",
        "名称": "长舌",
        "种族": "蛙裔",
        "描述": "你可以用你的长舌抓住近距离范围内的东西。你也可以标记1点压力，将其视为一把灵巧（Finesse）近战武器，造成等同于你的熟练的d12物理伤害。",
        "卡图": "resource/种族/蛙裔.png"
    },
    {
        "id": "Ribbet-2",
        "名称": "两栖",
        "种族": "蛙裔",
        "描述": "你可以在水下呼吸和移动，就像在陆地上一样轻松。",
        "卡图": "resource/种族/蛙裔.png"
    },
    {
        "id": "Simiah-1",
        "名称": "灵活",
        "种族": "猿族",
        "描述": "在角色创建时，你的闪避+1。",
        "卡图": "resource/种族/猿族.png"
    },
];

module.exports = RACES_CARD;