const GROUPS_DATA = [
  {
    "社群": "高城之民",
    "特性名": "特权",
    "描述": "你在与贵族结交、谈判价格或利用你的声誉来获取你想要的东西时掷骰中具有优势。"
  },
  {
    "社群": "博识之民",
    "特性名": "博览群书",
    "描述": "你在关于重要人物或地点的历史、文化和政治的掷骰中具有优势。"
  },
  {
    "社群": "结社之民",
    "特性名": "恪守",
    "描述": "记录下三种在你成长过程中灌输给你的格言或价值观。每短休一次，当你通过当前的行为体现这些原则之一时，你可以掷一个d20作为你的希望骰，而不是d12。"
  },
  {
    "社群": "山岭之民",
    "特性名": "稳健",
    "描述": "你在穿越危险悬崖和岩架、在恶劣环境下导航以及使用生存知识的掷骰中具有优势。此外，在角色创建时获得一个额外的护甲槽。"
  },
  {
    "社群": "滨海之民",
    "特性名": "潮起潮落",
    "描述": "你深谙生命和生活的变化无常。当你骰出恐惧结果时，在这张卡片上放置一个标记。你可以持有等于你等级数量的标记。在你进行动作掷骰之前，你可以花费一个或多个这些标记，将它们作为+1调整值加入你的掷骰中。在每局游戏结束时，清除所有未使用的标记。"
  },
  {
    "社群": "法外之民",
    "特性名": "恶棍",
    "描述": "你在与罪犯谈判、侦测谎言或寻找安全藏身之处的掷骰中具有优势。"
  },
  {
    "社群": "地下之民",
    "特性名": "微光生活",
    "描述": "当你处于微光或严重遮蔽的区域时，在隐匿、调查或感知该区域内细节的掷骰中具有优势。"
  },
  {
    "社群": "漂泊之民",
    "特性名": "游牧背包",
    "描述": "将一个游牧背包添加到你的携带物品中。每局游戏一次，你可以花费1点希望从背包中拿出一件对当前情况有用的普通物品。与GM一起确定这件物品是什么。"
  },
  {
    "社群": "荒野之民",
    "特性名": "轻盈步伐",
    "描述": "你的移动天然无声。在试图不被察觉的移动掷骰中具有优势。"
  }
];


